[{"text":"\n  I had a small rice cooker already, but it didn't have the smart functions, so when I saw that this one was priced at $69, I had to get it. A friend of mine bought the same model at a departmental store for almost twice the price, so this is definitely a great deal. I love how easy it is to measure the rice:water ratio with the dedicated measuring cup, the auto cook functions, and the timed cooking. Rice doesn't stick to the pot, and it's easy to clean. Awesome product.\n","id":"480eaf20-287d-49d9-83b0-fc0ee5d3a7a2"},{"text":"\n  Great product, at a nice price point as it is much cheaper than the prices in the physical retail shop. Although it is indicated as 8 settings in the listing, I received the version with 11 settings which was a nice surprise. Delivery was very quick and efficient too.\n","id":"9195bd3f-6d53-4493-9d18-65767d128a16"},{"text":"\n  We replaced a cheaper mini cooker which stopped working twice within 2 days from new and repaired with this Tefal cooker. Wife’s happy now 😁\n","id":"b0d5f01c-dd45-4f6e-8651-afca7a54522c"},{"text":"\n  The ladle should be included but it is not.\n","id":"d129f207-c11d-46a3-8837-a17d2f892995"},{"text":"\n  Very nice product easy to use for everybody\n","id":"9c1fa40a-c9ef-46cf-8cc5-91d7fdeab6f4"},{"text":"\n  Works like a charm, doesn't stick, doesn't burn\n","id":"9a881c1c-546c-44d6-a273-a89ef25fa7a2"},{"text":"\n  Very happy with my first rice cooker. Was affordable and is very easy to use.\n","id":"f45a84f5-42fc-4b4b-9645-2c8a3f9cccac"},{"text":"\n  reasonable price, nice looks,  worked well. just wishing it has a beep sound to indicate cooked status.\n","id":"f3417630-55fc-4ada-975e-faac23c263e4"},{"text":"\n  Great and arrived on time\n","id":"2a531001-a176-424b-bd84-36b3dd20a2f1"},{"text":"\n  Great value for money, finally a rice cooker that doesnt stick.\n","id":"3aae3f3f-770b-4c74-a1cb-723913b87dee"},{"text":"\n  Value for money\n","id":"79b15516-b5a9-4c41-8dde-aaf1dd9bc722"},{"text":"\n  Like - for different type of rice, including brown rice.  Rice is fluffy and nice.\n","id":"658829a3-db8d-4a66-adde-7fe92910c75b"},{"text":"\n  quality rice cooker. rice is tender and nice!\n","id":"9b0daa84-8f7b-49ca-a650-7316c1d25901"},{"text":"\n  Compact, cooks rice fast and nicely. Not too many functions, which is great and less complicated. Easy to clean.\n","id":"60d83ab7-6a0d-44b5-99cd-0a6dc12233f6"},{"text":"\n  Cooks rice well. Bit hard to know hotter Long is left while cooking but it is always quite quick.Good up to 4 cups of rice\n","id":"f32429d5-525d-48b4-b008-a88b1967dab7"},{"text":"\n  Saves time for dishes that take a long time to cook. Use hacks (found online) to cook two dishes at the same time. This will make it more useful and timesaving. You need to factor in the pressurising and depressurising times. You do not have to monitor the dish (unlike how it is when you cook it over the stove) and can go do other things while the food is being cooked in the Instant Pot.\n","id":"25b3a504-0adf-4029-84e9-60a39099e0e5"},{"text":"\n  I got this during a sale. It is great. I've never used an electric pressure cooker before but this has so many functions!\n","id":"c9c64c38-2a7a-48e9-bfe5-ccd9ca9c81ec"},{"text":"\n  Have used the same model for more than 10-yrs - very durable if you take good care 👍🏻\n","id":"dd28d0ff-d58f-42c1-ac93-e1c6b7f2a4db"},{"text":"\n  Not just for mini rice cookers, but the cookbook itself is \"mini\" - only about 5 inches square. It will easily get lost among your other cookbooks.Contains several recipes that would be easier done on the stovetop as they require continual monitoring of the cooker. You have to monitor it to turn it back on multiple times after it completes a cycle and resets itself to \"warm\" in order to complete the cooking process. And that defeats the purpose of using a cooker like this.Should be cheaper considering the little you get.\n","id":"d2a7e0dc-2606-4620-99a8-14a550855463"},{"text":"\n  Love my mini rice cooker, and this recipe book is a nice addition.  I only wish there were more recipes (for the price) in this tiny booklet, and suggestions for low-carb recipes - but I guess if you buy a rice cooker and rice cooker recipe book, you shouldn’t really expect low-carb recipes - but considering this lovely cooker and its many useful possibilities, I had hoped the author had explored more variety in the recipes.  Still, a good start for a tiny and wonderful mini rice cooker IDash) for singles, or couples who don’t need the jumbo rice cookers!\n","id":"5e182f2e-414c-4f5a-be9f-96fdcd6b2431"},{"text":"\n  Love the small size and it's stainless steel, not aluminum. I wish it would shut off and not stay on warm...it burns the bottom... So you must unplug it right away.\n","id":"86f8e644-5194-498b-a36d-ba65b7081fd0"},{"text":"\n  I got this as an add on to my rice cooker purchase but the recipes that came with the rice cooker are more useful! This is a tiny book with about 25 recipes, nicely illustrated but many involve using the cooker to sautee ingredients first (easier to do in a real pot!) and involved resetting the cooker several times. Ok if you are somewhere without a kitchen, but I wouldn't use any of the recipes at home.\n","id":"c92b972e-c30b-4272-b8b7-8dbb8b71d938"},{"text":"\n  I’ve made pineapple upside down cake, meat loaf and the sausage and red rice all shown above.The book shows the cake with apples, I used pineapple and cherries. Can use any fruit.The meat loaf recipe I fou f on google.\n","id":"3318b0db-ea87-437b-ba50-a0577a7f51bb"},{"text":"\n  Good value during sale. Love it. Cooks yummy rice.\n","id":"92da12ff-0926-4d02-af13-355f3612db87"},{"text":"\n  small and compact just nice for my small family of 4 rice is tasty and doesnt stick to the bottom\n","id":"a778892d-19b5-43cc-8fd0-d81f43b651d2"},{"text":"\n  Takes an hour and a half to cook white rice\n","id":"bf42dc48-d512-48af-bbd2-e9e212401e3d"},{"text":"\n  Yes, yes, yes ... these fit a 5 lb. bag of rice. I filled one with a 5 lb. bag of Carolina Basmati rice. It is completely full.I bought a set of 4 of these and loved them so much I bought another 8.The lids seem to have a tight seal. In fact, you have to haggle with the container to get the lid on. So much so that you'll probably think the lid doesn't fit. But, I got all 12 of my lids on so you'll be fine.The only bad things I can find, and I expected this before ordering, is that the measuring cup doesn't stay attached like it should. Some do, some don't. Also, the measure of the measuring cup is inaccurate. You'll have to measure out 1/4 cups with an accurate measure and marker the supplied cup. You'll want to do each one because they are not all the same. I only measured/marked 6 of my 12. 5 of them are the same and 1 is different. They all do hold a full cup though.\n","id":"4ece85bf-dc1c-4148-8edd-9a0b01b88ef8"},{"text":"\n  These were perfect for storing my rice. Seems to be air tight and was easy to clean.\n","id":"224e0fcf-66f3-4f8d-99ee-486a83bfea0f"},{"text":"\n  Unhappy. Purchased a 2-pack and one arrived busted.\n","id":"579405b3-3c40-4cbe-8fab-1daeefe9bdc5"},{"text":"\n  I like them but i have both the big and smaller ones and 2 of the 8 do not close right they want lock and therefore can come open easily\n","id":"cbd4f9a6-0185-40b8-8711-10d389ec6246"},{"text":"\n  the price is not very cheap but acceptable; however, the plastic is kind of thin.  First time purchase is fine, should buy only once.\n","id":"469ba9fe-3295-47e6-9f05-5e32a4df4ad2"},{"text":"\n  I purchased this product because my hair is severely damaged. After two washes my hair is thicker and much healthier. Before using, my hair would not stay braided/twisted without elastics on the ends due to excessive damage, with this shampoo my hair stays braided on its own - it's so awesome and I am very pleased. Honestly, I also coupled the shampoo with the deep conditioner and the fermented rice water spray. I encourage anyone who has fragile, damaged, brittle hair to give this shampoo a try but make sure you have a good conditioner to support it. I am going to re-order and if I have significant growth, I will post MORE pics.\n","id":"7f742ddd-ce8b-49e7-bf8d-758745be9c72"},{"text":"\n  Love it\n","id":"cf800f61-66b4-4001-8b9d-cee33209bbc7"},{"text":"\n  Cleaned okay but absolutely no difference in my hair. For the price - not worth it.\n","id":"50aa484a-28b2-4dce-afbd-9333f792c7d5"},{"text":"\n  I liked the price of the product and the description is accurate the shampoo works great with a pleasant smell.\n","id":"3e0df0c8-dd0b-4568-bc0d-9b1ef1c4a492"},{"text":"\n  Cleaned my hair very well without drying it out also made my hair much softer and after just one use my curls were looking nice after years of damage\n","id":"20b8e320-107a-4dbb-b75c-bc2b238d38af"},{"text":"\n  The inner pot is very thin, for the price I expected a thicker one like TIGER has.\n","id":"d2e3ea0b-c2ce-41c4-ae75-0a0854a29d8c"},{"text":"\n  Its the same like my old rice cooker, once the rice about to cook, the bubble start to flow out. Need to open the cover. I thought its the latest technology of rice cooker but sad that its not\n","id":"22f49720-f4f5-4cce-b8d9-1569dfe53cfa"},{"text":"\n  Value for money, perfect product for a family of 2-3 people who like to cook fresh rice every meal. size is just perfect too.\n","id":"3c6c528e-c561-405f-bd17-be30a448958d"},{"text":"\n  I bought not knowing it came in a pair.  size was what was describe. did not get the ecookbook.\n","id":"50c8c106-5a9f-4cab-ad1f-0645aaf36439"},{"text":"\n  Glove does not protect your fingers from being cut!  The knife cut right through the first time I used it!\n","id":"1306506e-bc84-4a8c-9e6d-444a07b5ff72"},{"text":"\n  Fantastic, no longer gets cut doing handyman work\n","id":"874aba29-d461-4b10-a6bb-aa831477b47a"},{"text":"\n  I initially ordered a size medium as I have arthritis and swollen knuckles. When they arrived, I found they were too big and the fingers were too long. I posted a review to this effect and the day I sent it back to Amazon, I received an email from the seller stating they were going to send me another pair in size small, free of charge. They also told me that I don't need to return the original pair. I'm glad I did as they can sell it to someone else. The new pair arrived within a few days and it fits perfectly now. I am so happy I made this purchase. Last summer I sliced off a chunk of my thumb using the mandoline. I will never have to go to the Emergency room for doing this again! Thank you, thank you, THANK YOU to the sellers of this wonderful product. It is a great product and your customer service is unbeatable! I am so happy!\n","id":"c1df5f7a-9523-43d5-a4c0-8a00fb131ac3"},{"text":"\n  Despite some of the reviews I've read, these gloves have stopped everything I have touched with them on. I use them in my woodworking shop where I have touched my belt sander with my fingers and I still have all my finger prints and nails. I am also a green horn knife smith and to this day I have not gotten a cut while wearing them. I even touched the blade on my table saw about a week ago, these gloves kept my thumb from injury except for a bruise!!!! Ruined my gloves, but not my hand, I ordered 2 more pair after that, and will always keep them on hand. DO NOT TRY THIS! I WAS VERY LUCKY!!!  Thank You NO-CRY!!!!!!\n","id":"dcb6ef95-55e1-478b-bd0b-5a7dca31e4d6"},{"text":"\n  After buying the High quality Hessler very high quality and sharp knives, the safety of my fingers was the biggest concern. So i decided to buy those gloves. They looks good and save you from accidentally cutting yourself.Just a caveat: Don't try to intentionally test them, the knife may poke your gloves or try to life ot tough hot objects. They are not made for handling hot stuff. Decent buy for your cutting needs in kitchen.\n","id":"16177fef-7d3d-4309-8b02-5e2c96499dca"},{"text":"\n  Since I wasn't sure what cut level 5 was (on what scale was my first question), I looked it up and found that the only level of higher protection available is actual chain mail. Now, the other bit of info I think is important to know is there is disagreement about how \"Certified EN388 Level 5 cut protection rating\" is not created equal. Just search the term and you will get more than you'll want to read.However, all that being said, I went ahead and bought the gloves. They are a true fit (the palm measurement provided works) and they are flexible to work with. I've tested them a little bit with gripping my knives, which I sharpen after each use, and they seem to do the job. The only thing I can't advise here is if they save you with a big chop or rapid mandolin action. Should that accident happen, I'll add to this review. But the bottom line is I'm glad we have them, and they do add more protection and confidence to kitchen tasks.\n","id":"f4597ae7-6959-4dfb-9965-9ee1de7b94bf"},{"text":"\n  I lopped off the end of my thumb last week while cutting sweet potatoes. After regaining consciousness I purchased a pair of these NoCry cut resistance gloves and couldn't be happier.\n","id":"b919994a-febf-475b-9560-294b081fa043"},{"text":"\n  One of the top rice brands in Singapore, always tastes good and soft/fluffy/fragrant.\n","id":"1399ffc6-bee3-4d82-b4ad-dd787c26acf8"},{"text":"\n  Great scale, works as intended and would definitely buy again.\n","id":"5bb32ce7-db36-4ad7-9ca3-92f8ba662d79"},{"text":"\n  this thing didn't work, after zeroing the scale out to weight out my nutrients for my hydroponic garden, the scales numbers would just continue to just drop in weight, never stopping on a number, I got tired of messing with it and bought a new one at Walmart\n","id":"1b986c19-e860-4381-a330-cc503a0be0fe"},{"text":"\n  Great little scale so far still accurate months later and gets used at least 3 times a week.\n","id":"576e4886-8edc-463f-aefd-1cd64881ab1b"},{"text":"\n  Dope\n","id":"5ee8a9d0-c735-4914-9c58-29f917876d5a"},{"text":"\n  Loved the different options for weights grams, ounces etc!\n","id":"c418709b-b382-4aad-93ce-cb54d337c7ae"},{"text":"\n  I have one and just love it! I bought a second one to gift to a working mom with no time to cook for her two children.  Whatever she tried to make never seemed to turn out.  Shes already made a wonderful rice dish flawlessly right after opening the box.  She is ecstatic beyond words.  This rice cooker is easy to use, quick to clean up and convenient to store. It has hit all the jey marks for a great kitchen addition!\n","id":"1d3d6573-1282-47f1-9cce-314b019f8511"},{"text":"\n  For some reason there are duplicate recipes wasting pages in this book. Therefore I cannot rate this very high and I am very disappointed. I am just happy I did not spend a lot of money on it. Unfortunately my return window closed (my fault for procrastinating), so it will now be placed in a drawer til a friend has a yard sale.\n","id":"8171a72b-bd47-4deb-8f9c-f36c3949bb81"},{"text":"\n  Seems like a great starter cookbook if one is new to using an Aroma rice cooker. Even if one doesn’t use every recipe it can inspire ideas for similar meals and what steps/settings are likely to lead to success.\n","id":"a57767fe-46cc-46c4-8540-845ff4212c0e"},{"text":"\n  It's a really nice cookbook, some good sounding recipes, lovely photos.  I am looking for recipes other than rice and/or grains.. Like steaming fish and veggies..I realize the rice cooker is specifically made for grains, but would like to be able to expand usage.\n","id":"b54f5a6e-fc01-42c6-837c-63706bcc5b08"},{"text":"\n  I haven't tried making any of these recipes yet, definitely plan on doing so in the near future. I was going through the cookbook and got excited to try out a few of recipes. I was pleasantly surprised on the many various recipes there are in here.\n","id":"a11ea33f-dc6f-4fd0-b873-b4b4c814cb38"},{"text":"\n  The size is good. The upper tray is too shallow.\n","id":"f308f17a-88b8-425a-bb7e-593537d34efb"},{"text":"\n  I used it the first time to cook some brown rice.  After soaking the rice that was stuck to the bottom of the pot overnight,  the inside of the pot was stained with marks that could not be washed away. Be careful if you are using the steamer. You should open the cover and let it cool down a little before removing the steamer or you will get your hands scalded by the steam which comes out from the rice cooker. Or put on a pair of oven gloves!\n","id":"d561f1d5-646a-438a-9d38-8b26eaf74dcc"},{"text":"\n  This is a decent little box. As others have stated the lid is a little loose and it would be nice if there was a more secure way to attach it. That said I haven’t had it fall off yet.\n","id":"b52790ea-c4ce-40ee-8414-c422b9083c07"},{"text":"\n  Wonderful product, high quality, perfect size. I use this as a bowl for backpacking/camping. But it can also be used as a small boiling pot, or lunchbox as advertised. The top fits snug and well. It also has a folding handle, unlike competing titanium bowls. It definitely beats all competitors in terms of a multi purpose bowl.\n","id":"8f51b50a-62be-4c01-926e-156fad5b82b8"},{"text":"\n  I love this product. I was looking for something lightweight and multipurpose to carry in my daypack. This is perfect for carrying snacks, used as a pan or a bowl, or for heating water for tea. I intend to get a larger size for nesting.\n","id":"d6eded1a-5de5-45ed-b3ed-cf722cf744da"},{"text":"\n  If you r backpacking and don't want to carry the kitchen sink, Titanum is the answer, it (Titanium) is unbelievably light and strong, won't rust like steel or stainless steel.I would recommend it!\n","id":"c3edadee-20c3-41b5-97c3-6b6d6ea308a6"},{"text":"\n  No complaints everything fits well, super light, quality product.\n","id":"3671c162-612c-47bf-ab6d-5733fca4ed86"},{"text":"\n  Originally was going to pick up King Piccolo much later, but decided to jump on him right away before prices went up, especially because he comes with the 1 star Dragon Ball. I'm glad I did, easily one of the better pieces in the collection. He's simply huge, and has a lot of weight to him, I think he even outweighs Napa and the smaller Broly.Very impressive figure.\n","id":"ceee1913-8f42-4dc3-beea-4205557edc05"},{"text":"\n  Great likeness. They give a lot of accessories that seem to be rarer from Bandai these days. These figures are for posing and bringing stories to life so they are fragile to an extent.Maybe could have added an old face plate, even though it wouldn't strictly match the original story.\n","id":"cc1b6052-e67a-417b-9b53-9768da3e1c4b"},{"text":"\n  Excelente figura.\n","id":"613e38ec-6818-40ab-a0dc-6ec99b571731"},{"text":"\n  It even comes with the Rice Cooker! The accessories are fantastic, the articulation is superb, and the paint applications are crisp. A Kami and Garlic Jr. would be a great addition!\n","id":"c48dc9c7-735d-40f6-82c1-2bb05804e3a5"},{"text":"\n  Gave this ad a gift for my husband's Christmas gift and it was his favorite.  Very durable and a great gift.\n","id":"3aa078d0-c890-470f-a23e-1ad04288cc61"},{"text":"\n  When cooking rice it starting liquid overflowing now. It used to be okay for same amount of cooking at same style.\n","id":"da4d4470-9ba9-4829-bd92-e69e35e92a5e"},{"text":"\n  This rice cooker is very good.  My only dislike is that when steaming vegetables they cook a lot quicker then what the instructions tell you.  So if you prefer a crisper steamed vegetable, do not cook for the recommended time.\n","id":"85b53637-017a-4101-9c26-29916f8df2c0"},{"text":"\n  Love it!!!!!!!!!\n","id":"60d2f40c-cd0d-45bd-bf80-2be9b15ab7c0"},{"text":"\n  Utter crap. Gently warms the water but does not cook the rice. Customer service line is useless. Looks like I've flushed $40 down the drain.\n","id":"d7f254ca-0642-4dab-b98e-b3edb2f8434f"},{"text":"\n  A very good rice cooker.\n","id":"d592fdbd-0487-4708-8692-4753a48c36f9"},{"text":"\n  I LOVE my Beaba babycook and got this pasta/grain insert so I could make even more foods.  It's a nice substantial weight and I like that it's white rather than the semi-transparent color of the steamer basket (which already looks a bit dirty).  However, theres barely any cooking instructions included and they few they include are vague and didn't work for me.  I consistently have found I need far more water than the instructions call for and often a full second cooking cycle in order to cook grains enough.  Also, food and water measurements are in (European) milliliters or grams.  Which is fine, I happened to have a kitchen scale and european measuring cups thanks to my Swedish husband.  My gripe is that I'd like to be able to use the babycook mixing bowl to measure water to add to the insert but the measurements printed on the bowl don't match those in the recipes. For instance, the recipes for rice and pasta calls for 120mL and 180mL, yet the mixing box has tick marks for 150 and 200mL.  The insert itself doesn't have any marks to help with measuring.  Small detail, but it's a design flaw that could have been improved in a few ways that would make using the product easier.  Overall, I use it, but not without hassle and I'm not sure I feel it's even worth the $8 I spent on it.  I wish it had just been included in the babycook system and had better recipes and instructions.\n","id":"80948559-0c67-4183-a537-776addca232b"},{"text":"\n  Not sure if it’s a Beaba issue or an issue pertaining to this accessory, but lentils take 3 runs to throughly cook. I don’t even know if it even works with beans.Not worth the time and effort.\n","id":"521415f2-42a8-454c-980a-825db8dd0547"},{"text":"\n  Does not cook rice or quinoa well, especially brown rice. It takes some trials to figure out water and rice ratio. Just make sure you are also adding water to the actually container where you put the rice. Instructions are horrible and measure rice in grams, which is an odd measurement in the US. So gotta convert to cups of uncooked rice. I just cook rice on the stove. Have not tried pasta yet.\n","id":"ffaad82f-5f54-4b66-b00c-9048de70c221"},{"text":"\n  Only bought it bevause I bought the Beaba machine but it didnt steam my rice properly. Ended up throwing out the rice and making my son rice in a pot. Not worth the $$\n","id":"760abba2-5fa5-444b-94ac-a73e1e449f27"},{"text":"\n  My son enjoys it\n","id":"656ebb07-346d-4520-975f-1c5687a735d1"},{"text":"\n  If you're looking for a non stick rice paddle, look no further. My husband & I were blown away with this rice paddle. It sticks right to the side of our rice cooker & is out of the way. We eat Korean sticky white rice & it doesn't stick to the paddle at all!! We absolutely love this & makes meal times much more easier. I recommend this to anyone who eats rice that sticks to everything. It arrived much sooner than we thought & was thankful it did.\n","id":"bfcd78c7-cad4-4e23-8a7c-390ad459f2c1"},{"text":"\n  I ordered along with the rice cooker, that did not work out but love the rice paddle set!\n","id":"2bc54161-920c-4832-b562-08c59b20b561"},{"text":"\n  Excellent! Buy it. Easy to clean. Rice never sticks. Scoops along the bottom. It is perfect. Buy it. Buy it now!\n","id":"3bdc353f-019b-44cd-b050-541f9a266ca3"},{"text":"\n  Very well made rice spatula. The shape of it makes it easier to scoop rice out of the cooker. It is more convenient than a straight rice spatula. Because, with a straight spatula, the rice is more likely to spill.\n","id":"c519a70b-cbc5-4fc5-a404-2b886ff6d60d"},{"text":"\n  Niceee\n","id":"42e2af53-f362-4577-9d5f-a981d1004a8e"},{"text":"\n  I have not cleaned my \"Zojirushi CD-WBC40 Micom 4-Liter Electric Water Boiler and Warmer\" in three and a half years of continuous use (See image). I followed the instruction exactly as given and afterward sprayed the water boiler out with the kitchen sink sprayer. The sides were clean but the bottom and the filter still had heavy mineral buildup. This is to be expected, because the instructions are for routine MAINTENANCE cleanings, NOT for heavy mineral buildup from years of neglect. To get the heavy mineral buildup left behind, add one packet (it is citric acid powder) to a cup of warm water, stir well, then add ONLY three more cups of water and run the cleaning cycle. The citric acid in the water is too dilute otherwise. All the mineral buildup should be cleaned off.I read one of the reviews on this site and someone was worried about \"harsh chemicals\" being used. All this product is is citric Acid, it is completely safe; if you are worried about ANY citric acid residue, you would immediately notice a strong tart taste in the water if there were any citric acid left.\n","id":"7f405b63-94db-44d3-8991-550d0f83393d"},{"text":"\n  So glad that I read the reviews. I diluted a packet in a cup of warm water, per the directions, poured that in and then filled the tank. After it ran through the cleaning cycle the whatever-it-is at the bottom was still there. Read a review which said to only use a few cups of water, not to fill the whole thing which makes perfect sense because the citric acid is too diluted. I did it again but added 3 cups of water after diluting the pack in one cup and ran through yet another hour plus cycle and it worked!!!\n","id":"6da145af-da57-4553-86b7-522a98c17389"},{"text":"\n  We live in Florida. The tap water quality is poor. It contains a lot of hard minerals. They just stay at the bottom of my water boiler. It's hard to get rid of them. I tried baking soda with vinegar, it did not work well. Then I purchased this cleaner. It's amazing. I followed the instruction, my boiler looks like brand new. It removed 95% of that mineral stuff.\n","id":"1a440265-727f-4837-bec6-7a98a5949756"},{"text":"\n  Great cleaner for Zojirushi hot water kettle (dispenser?  Not sure what to call it).  I live in Los Angeles, which has pretty hard water.  Bought this after finding out my partner was not using filtered water on refilling it and saw a ton of scale buildup on the inside and bottom, to the point where some of it was flaking off.Watch the instructions online!  It's not a simple dump it and go.  You have to dissolve it in a cup of warm water, then add the water to the dispenser and set it to clean.  It will clean for roughly one hour, at which point you need to dump the water and refill it.  Let it get to boiling (~10 minutes) and then pump out a cup of water to rinse it out, then dump and replace the water.I also am not sure if this can be accomplished by using a cheaper citric acid but, given the cost of the dispenser, I opted to pay the Zojirushi price.  Seems expensive for what it is, but it works and works extremely well.\n","id":"ef95ed75-c2df-4dd7-b263-1b61ccca176c"},{"text":"\n  I have a Dualit Electric Kettle and a Zojirushi Coffee Maker.  I used this cleaner for both. My kettle came out gleaming, I was ecstatic with this result because (shame on me) but I had not cleaned my kettle or my coffee for approximately 12 months and I was delighted with the results.This cleaner is very easy to use.\n","id":"0b941cdc-0dba-4861-b33a-4051bf2bc845"},{"text":"\n  Based on the title, I didn’t expect some of the more rare ingredients called for. There also are some that require other appliances etc, which sort of moves away from ‘easy’. I bought the book for my college student daughter additional note, this book assumes that your rice cooker is also a pressure cooker. Not what I was looking for.\n","id":"48b9446d-c1ba-4080-8fd8-0cab98c83d07"},{"text":"\n  This book is for fancy rice pots with settings. Not your everyday rice pot. A lot of ingredients are not cheap and not stuff I just have in the cupboard. Did not find one recipe  I could make Without a huge grocery list of stuff I don’t normally use\n","id":"23b715e0-59de-4694-90ca-7271c07d6041"},{"text":"\n  This book has yummy recipes for the rice cooker! Being on a low carb diet, I honestly thought it wouldn't help me but then this virus came and diet no more! With an abundance of rice, vegetables and meats from local farmers, I am going to be cooking all out in my rice cooker and this book is a great help!\n","id":"467fe8cb-3bdd-4c72-a51a-09e83605836b"},{"text":"\n  I was surprised at the amount of great sounding recipes in this paperback.  I have tried several and they are really good and very healthy ones.  They are many and not all about rice.  I will be trying more of these on my family.\n","id":"f1447732-99ee-4776-91ff-ddd41a0768a6"},{"text":"\n  This cookbook has changed that. Besides a huge variety of rice recipes, there are some meaty choices, veggie ideas and even dishes without rice included. I was surprised to see the desserts that can be made in a rice cooker.\n","id":"52f29571-ba8f-4044-bc4c-1863b8e44b6a"},{"text":"\n  These brushes are probably the best thing I have ever bought. I've purchased the gentle white ones, multipurpose yellow, and the multipurpose green ones. I plan to get the red and black heavy duty as well as the bathroom scouring pads. Seriously, the only thing I could complain about is the fact that my still battery runs out from constant use. I have used these on my couches, floors, toilet, bathtub, counter tops, appliances, even a mattress to help get out a pee stain from my toddler! I had no idea what I was missing until I got these! Be aware that if you have furry pets, their hair will get into the bristles and spin up into a knot in the very center but it's easy to just grab the clump out. The bristles are sturdy and well made. I have yet to see any fall out and that is even after I caught my husky chewing on one of them. The extension rods are fantastic as well! It gives you a whole new range of motion. The brush head that looks like a toilet brush is the easiest one to use for small spaces because it can reach pretty much anywhere and still spin.You honestly can't go wrong with these. I've had mine for about a month now and they still look and function like new. 10/10 would buy again.\n","id":"12acf51b-0ee8-4af3-8cfe-b43136b9f054"},{"text":"\n  Received this and immediately tested it cleaning a very dirty bathtub/shower. It was easy to attach to the drill, and it made cleaning *much* less of a chore. It far surpassed what I could accomplish with elbow grease and a regular brush. That said, I do have a hunch that I should have opted for the slightly stiffer brush sold here by the same company. (That's actually less an observation about the brush than about my need to clean my shower more often. If I had to order again, I'd probably opt for a package that includes more than one stiffness as opposed to multiple shapes.)I can't comment yet on the brush's durability, but nothing about its construction indicates that it won't hold up well for a long time.Kudos to the inventors for making such a useful tool! I'd recommend this item to anyone looking to make their household cleaning easier.\n","id":"10cf4b1c-def4-4924-8aaa-d07ba80b84c4"},{"text":"\n  I used it to clean the textured porcelain tile and grout on our kitchen floor.  It worked great - I could not be happier with the product.  It took some time and elbow grease; but, it was much easier than cleaning by hand with a brush.Procedure:  I soaked a small area of tile (several square feet) with a mixture of white vinegar and water (50/50).  After approx. 5-10 minutes, I used the scrub brush/drill to clean the tile and grout.  Then I used a towel to soak up the dirty solution.  The final step was to mop the clean area with clean hot water and soak up the water with a clean towel.  Result exceeded expectations.\n","id":"f4fdce04-bfe5-4ca7-ae22-1b8183dc6948"},{"text":"\n  I bought a 12 year-old used car with an absolutely filthy interior. I knew standard scrubbing wasn't going to cut it so purchased this drill brush kit. I would not recommend using this on new car upholstery if you are looking for gentle action, because even with light pressure it does rough up the upholstery a bit. If you had just a spot, for example, this would make that one spot look more worn.  Bur for my case it offered dramatic results scrubbing in a way that I never would have been able to by hand. I bought a pack of microfiber cleaning cloths at Costco, and based on suggestions from Youtube car detailers using this brush, just sprayed Simple Green to saturate the fabric, then scrubbed with the drill brush in circles, then pulled up the dirty liquid by pressing the microfiber cloths into the wet, scrubbed areas. I just pushed and pushed to sop and sop up dirty moisture until it was as dry as I could get it and then let it air dry all day. I'm shocked at how clean it could get.\n","id":"320c7fb9-0179-43a4-8ac6-1b07f72f1d8c"},{"text":"\n  This is not my first Drillbrush purchase but this set is better than my original brushes only because they are all 1/4\" shank that fits the extension.  My first one did not.  I probably should have purchased the green brush just for my shower floor but the yellow works OK.  I like the easy change with the extension.  I do wish the extension were longer since I am getting older and don't bend quite so easily.  The brushes are sturdy and work just fine.  I have no issues with any of the brushes including the ones from my first purchase.  They completed a good bit of service.  I will buy Drillbrush again as the need arises.\n","id":"c2dff946-2df0-4a97-a8f1-9ac6e2ce0762"},{"text":"\n  First off, the actual warmer is fine and heats up quickly but the metal bowl part is not detachable. Good part of the warmer is it’s really a non stick so after getting off the sides of the cooled wax I just flipped the warmer upside down and the wax popped out. The 3 stars are purely for the warmer. The wax it comes with get zero stars. I tried it waxing my upper lip and legs and it got maybe 50% of the hair, if even that. I had to get out my other warmer with my trusty Ajoura brand wax to re-wax those areas.\n","id":"e59c8c3b-f9cd-4564-99a2-2d65ed1b06bb"},{"text":"\n  I am a travel enthusiast who have visited lots of countries, the biggest problem is I can not use my electrical appliances due to the different power stripe standards across the country.. I tried some adapters before, but none of them works well until I bought this voltage converter 2 weeks ago.This power converter could convert the voltage from 220V to 110V while still support 2000 Watt appliances like my wife’s hair dryer. It comes with 5 adapters so that I can use it to travel in almost any countries I like.It also comes with 4 USB output ports, all of them are compatible with our Samsung and iphone/ ipad and even a LG phone from my friend. The blue USB port is surprisingly fast. I actually got my cell phone from 5% battery to almost fully recharged within 40 minutes...Everything works perfectly, highly recommended !!!\n","id":"20aee3bf-6997-4a72-b4d8-501958ea06e0"},{"text":"\n  I took this converter to Lima, Peru, and it worked exactly as it was supposed to. I read all of the 1- and 2-star reviews, and bought it with caution. I now know that these were either written by people who did not read the restrictions that are right in the description [*Not compatible with hair straightener, hair curler flat iron, blender, rice cooker, trimmer or toothbrush], or are trolls who delight in spreading misinformation. I used it with several appliances without difficulty, and flawlessly recharged my phone and tablet with the USB outlets. I did try it with my electric toothbrush, and it did not work - EXACTLY AS THEY WARNED.My biggest fear was that it would be noisy. I kept it plugged in for a week and held it up to me ear almost every day (to ensure that it wasn't making noise only occasionally.) It was absolutely silent! I think there is a fan in it, but it makes no sound at all. Don't believe the trolls!Plugs for every country on Earth, works exactly as advertised, and is silent. Works exactly as advertised.\n","id":"ba7c60ff-045f-4533-8ae1-963908d0c1bf"},{"text":"\n  This voltage converter to be used so that appliances that are of the 120V compatibility will work in countries that use the 240v standard. As I got many items abroad, this is very useful and the 2000 wattage availability of this device gives it an extra punch compared to other items on the market which are about a quarter of the wattage power. This is very important as a lot of devices I use are above the 2-300 watt threshold of the usual wattage converters. I am very grateful for technology and time has produced this devices so that I am able to use things such as my American projector, Canadian market remote drones and electric cars. Just plug it in and let the device handle the rest.\n","id":"3802f890-7bea-47a3-ba13-6fd560fc6ffa"},{"text":"\n  The product I’ve been waiting for! Most of these converters are way underpowered at 300W or even less.  Finally a solid product for me that has the juice I need. 2000W converter works just like any other converter, except that it can handle devices about 8 times more than the average 30 dollar variety. Use is easy, just find the corresponding adapter to wherever country you are at and plug into the wall, Plug your 120v product into the converter and watch your device run as if you were in the country that the device was built for. Solid item and works great so far.  Not a single complaint, other than this world not having universally compatible power.\n","id":"d6fd2c39-8327-47a2-832e-5b48af61ccc0"},{"text":"\n  I liked the fact that this actually worked. I ordered one of the larger ones from another company first and it did not work. Sent to my husband in Poland for him to use with a microwave and it works great. They are on a 220 to 230 volt 50 hz electric output there and I sent a US microwave. Husband also said it has USB ports and everything. Don't know about durability as he just got it but I'm so glad it works.\n","id":"caba074f-26bb-4689-b49a-94b736d439c8"},{"text":"\n  Its a cute and functional rice cooker with thoughtfully designed cover that allows you to rest it on the table without making a water mess from steam. It doesnt burn my rice on the bottom like my previous cooker. I would recommend it.\n","id":"297a6dc5-45d0-47c7-ab3a-def441baece6"},{"text":"\n  Came vacuum packed. Rice is really tasty and affordable for short grain rice. Also cheaper than Songhe’s Thai jasmine rice, which doesn’t taste as good\n","id":"f9b2e20a-96b4-4018-b972-3d551b1f9350"},{"text":"\n  The rice bag was delivered within 2 days from the order date. The bag is fully vacuumed and put inside a sturdy box with lots of airbags as cushions. HIghly recommend.\n","id":"089c22e4-73ed-4889-94e4-8970f4456b10"},{"text":"\n  It was not vaccum packed per product title. Hopefully it is ok as I have yet to open it.\n","id":"43801875-7e42-46b2-ab31-57403a8ae2e3"},{"text":"\n  Item is not vacuum packed even though the product description says it is.\n","id":"c8caa5ca-30ba-4015-8d46-ac02abb90c1b"},{"text":"\n  Is vacuum pack.\n","id":"d3c72d88-4ba3-458b-87e6-fba775fcd4b7"},{"text":"\n  Well received.\n","id":"4b6b3c72-aa4a-4b29-884f-107dea5a6fdb"},{"text":"\n  Not vacuum packaged as advertised\n","id":"262af0df-971c-4679-a68f-a3291eaedfc9"},{"text":"\n  good deal\n","id":"c2d1fa72-bbda-42ff-9392-be8d59802206"},{"text":"\n  I saw one of these on a trip to Japan last summer and  had to get one for myself.  Looks great on the cooktop.\n","id":"96b89010-26a1-4d91-8cfe-e4a945fea15e"},{"text":"\n  I was looking for kinto rice cooker so long.I love it!\n","id":"42864fd1-a38a-4c79-a616-6c936ecb2b5a"},{"text":"\n  Best rice cooker I have ever bought.\n","id":"0b608629-aef4-42d7-bc8a-4951977c56b0"},{"text":"\n  makes perfect rice every time\n","id":"47d2e8a9-2178-4980-abeb-75bc2c14cd6f"},{"text":"\n  I love it\n","id":"f6566c1a-769e-4cea-b086-0c509a91d625"},{"text":"\n  Remains clean, no water overflow like cheaper models, the bowl is non-stick. The measurements of the water levels you need to get used to, but good so far.\n","id":"b5c632a7-2326-413c-8da5-6cd17522e054"},{"text":"\n  I like it, easy to use\n","id":"80a62f89-75d8-4dc5-a137-de94530f4c14"},{"text":"\n  This was a great set...so fun!!  Various scales..so this is a fun set for a minaturest that works in scales 1:48, 1:25, 1:18 and 1:12!\n","id":"8892fb35-e3d8-40e7-a97e-cd3e33805705"},{"text":"\n  These are the cutest little accessories for doll play. They are tiny so, not the proper size for Barbie but any kid with an imagination won’t mind that. They’re sturdy and have an antique look.\n","id":"7d6b0f38-3148-4647-9cdc-34a13a16d891"},{"text":"\n  I used this as cake decorations for a repair event. They were a hit!\n","id":"27b2013e-5bf6-4b41-b438-861a80bee51d"},{"text":"\n  In an attempt to remove a 6yr semi-transparent coating on pressure treated wood, especially difficult to reach places, I thought the DPS brush would access those areas easily and remove the coating. The bristles aren't stiff enough and anything else less pliable would ruin the wood.All was not lost, \"the brush\" did remove the material in places where I would have had to use a tool that would have been more time consuming.I did power wash before fine tuning.\n","id":"6ca454df-3954-43b6-807f-583432e4239d"},{"text":"\n  It made cleaning off my acrylic shower walls at least 1 years worth of soap scum very quick and easy compared to trying to do it by hand!TIP:  I would recommend wearing a face mask and clear protective eyewear when you use this however, as it is easy to get \"sprayed\" in your face with old soap scum.\n","id":"1d261a0c-ba1b-40d1-9ab9-18c746171499"},{"text":"\n  Works great!!Caution with Drill Torque!!!May injure your wrist.\n","id":"d4b64d34-f950-4b20-813b-06dc680d91af"},{"text":"\n  The brush seems like a good idea and good quality, but my husband said that is the not the best brush to be used on a BBQ grill. The brush is nylon so a good cleaning brush for others household things, but not for our grill.\n","id":"6383869e-203b-46a4-bdbc-9b997cb3f1c6"},{"text":"\n  Good product. Cleans the grill thoroughly.\n","id":"70cca745-795a-4f25-bffc-7c5e45554b3a"},{"text":"\n  Worked great.. good quality. Light weight. Handles didn’t seem to get to hot even directly on the fire...Update 8/13/19 still bad ass... used often. Buy it.. it’s what you are looking for.\n","id":"d268a0da-6fc9-4597-b02a-e62fd4ceccb9"},{"text":"\n  What a great set for couple/family camping. I've used the pots on a cook stove and open fire and the handles provide easy lifting with no mits required. The steam hole in each lid prevent boil over and let you know when water is boiling. The only thing I'd add would be 2 and 4 cup marks on both cook pots. I would also like to see the bowl labeled with a 1cup measurement mark. Other than that an awesome product that I am very happy to own!!\n","id":"279c1a31-365c-4df9-8405-faebf7a23499"},{"text":"\n  We purchased these to replace our bulky \"leftover\" camping cookware. They are fabulous! Lightweight but sturdy and well-made; the handlescwork well and stay cool.  Very compact but large enough to prepare meals for 2-4 people. They are perfect for our 2-burner Coleman stove. I was skeptical about the little tea kettle, but it might be my favorite piece; perfectly balanced and the pour spout works well. I like the non-stick coating, although the stainless option might prove better for the long haul.\n","id":"dc25139c-2a2c-4865-9dae-54b650044b3c"},{"text":"\n  Don't know why the reviews are so good for this. I had a terrible time with this cookware set on my camping trip and the ONLY good thing I can say about it is that it is compact and lightweight. If you are backpacking I can see how that would be important, but literally everything else about this set is terrible. Here is a detailed breakdown:- NOT non-stick. Everything I cooked stuck horribly to this and was a terrible sticky mess to scrape out of the pans. It did not matter how much oil I used. I cooked burgers in the pan and they were ruined because they were totally stuck to the pan when I tried to flip them. Eggs would stick terribly. Everything sticks terribly to these. Save yourself the trouble and get a good teflon pan or two, or cast iron if you are car camping and don't care about the heft. My wife and I spent half an hour after every dinner scrubbing away at these horrible pans; it was a huge chore and I regretted not bringing a normal pan or two.- Cookware is thin and does not transfer heat evenly. The pans are basically paper-thin and as such have horrible hot spots that will cause you to burn parts of your dish.- \"Frying pan\" is too small to cook any decent amount of food and has very steep vertical sides, making it basically impossible to get a spatula in there to flip things over. But it doesn't really matter since everything you try to cook will be welded to the bottom of the pan long before that even becomes an issue.- The flip out handles are a nightmare in practice and get very hot since they are close to the side of the pan. They don't latch together or anything, so they are flopping about when trying to move the pan around. Potentially dangerous since it could result in you spilling a pot full of boiling liquid on yourself when the handles flop about.  Again, bring a few normal pots and pans unless you absolutely must have an ultra-compact cookware set for backpacking.- The plates and bowls are a joke. See photo of them next to an average sized dinner plate. They are flimsy cheap plastic and the plate holds enough food for a child, but not for an adult unless sloppily overloaded. The bowls are uselessly small; they hold about 1/2 cup of liquid. We ended up eating out of the pots directly if we wanted something like soup, since the bowls were way too small to be useful.In summary, this was a very frustrating set to use due to the small size of everything and the complete failure of the non-stick surface, and I'll be returning it. Do not consider this unless you are extremely size/weight constrained. If you are car camping, just bring some normal pots and pans and some plastic plates and bowls, and save yourself the trouble.\n","id":"3fd86616-0771-49fe-9f9a-8ba61569a43f"},{"text":"\n  I purchased this set and another, almost identical set from another manufacturer for the same price in order to compare them side by side. Both sets included almost identical products, similar bags, etc. the differences being minor details. This set was advertised as having 7 large plates, 7 small plates and 6 bowls (all lightweight, BPA-free plastic). The other set came instead with 6 plates, 6 sets of silverware ( knife, fork, spoon) and 6 8-ounce glasses (all stainless steel, cups have silicon sleeves).  The good:  This set was lighter weight by 2 1/2 pounds.  The lids on this set are superior in design and construction compared to the other set, as is the much more robust and sturdy bracket which holds the handle to the biggest (4l) pan. The kettle in this set is larger, holding approximately one cup more liquid. The bag on this set is also of superior quality and construction.  The not so good: This set DID NOT include 7 each of the large and small plates, rather it is 7 total, 3 large (9inch) and 4 small (8 inch) plates. The pans on this set are 1/2 to 1 mm thinner than on the other set (making them slightly lighter in weight and less robust overall), and the handles are looser and have more play (with the exception of the largest pan).  In conclusion: still a good value, construction is acceptable and arrived promptly. I am deducting a star for billing it in the description as having 7 of each type of plate instead of seven total. I have not field tested either set yet, but will update my review once I do, and will be posting head-to-head comparison videos of each set, both on initial impressions and another of field tests when I get the chance.\n","id":"2fc4e5c0-621d-4e78-b14a-3ec514f5bebe"},{"text":"\n  As advertised\n","id":"9f050f9e-7b6a-402c-a9e2-d5aa06e69212"},{"text":"\n  This is an auto-transformer. As it only has three leads on the transformer, it provides no isolation. If you use it to step up voltage, the output will be 230 volts relative to neutral or ground. Twice the usual.I plan to use this with a generator to power my well pump during power outages so the isolation isn’t an issue.I took the cover off to check the circuit and found a wire soldered improperly to one of the outlets. This was a 12 Ga wire held on by only a couple of strands. I wasn’t planning to use this outlet but it could have broken off and made a dangerous situation.Update. After testing for a few hours, the fuse holder failed.  Poor contact to fuse and holder led to bad electronic smell.  Had to replace fuse holder.  Poor quality, unreliable unit.\n","id":"bb99308a-e2e2-475f-b7b6-f7d036216054"},{"text":"\n  It's a bit bulkier than I would like but given the wattage it supports, I can deal with the thing sitting on the kitchen floor. I've already used it with all my 220v appliances and they all function normally. I used my Panasonic rice cooker and rice was cooked with no issue in 50min. I used it with the electric kettle and the toaster and both did their jobs as before. I also vacuumed the entire apartment with my Dyson canister without any issue. It was quiet without any unusual noise or humming during usage. It is quite versatile with both step-up and step-down functions but I seriously doubt I would ever need it to step down from 220v to 110v. The separate power input sockets are clearly marked for 110v or 220v. Since this is sold in the US, it only comes with a US plug power cord. For those looking to use it for step-down, you'll have to find a cord with the plug type you need. There are two 110 outlets and two 220 outlets with one being universal (fit my UK type plugs) and one three-prong type (not sure what it is). The strap on top makes it easy if you do need to move it around. For under $120 it's a pretty good deal as it enables me to use my existing appliances, especially the Pansonic and Dyson without having to buy new ones, which will cost me way more than $120.\n","id":"9eae068c-e9cc-4c9c-9d5a-86ab66540939"},{"text":"\n  I recently move to Kuwait and had a few 120v appliances I could not bear to part with so I needed a transformer.  After looking at many different brands, I settled on this one as it is both a step up and step down device, which is great incase I buy something I cannot part with when I eventually move back to the US.I have been using the transformer for over a month now and have had no problems.  It seems well made and it is rather heavy; some people may have difficulties in picking it up and moving it around.\n","id":"d74589c6-2322-4ca2-9bff-f89430a6b3f8"},{"text":"\n  Thanks for destroying $2,000 worth of my son's computer equipment! Now he has no computer to do his homework with. I plugged it in and all the circuits on my equipment were immediately fried. Took a voltage meter and the 220v output on this converter actually puts out 254-255 volts! That's more than my equipment's maximum voltage rating. I want my money back, and no I am not willing to go out and send it back. Costs too much of my time, money  and energy! If you want proof, I can send you a picture of the voltage reading.\n","id":"96668b05-8384-46d6-8127-4e47309763de"},{"text":"\n  I bought a subwoofer (mj acoustics 400-sr) from England.  It came wired for UK AC power. Rather than send it back and get one for US AC power, I decided to try a transformer.After much research, I selected the Goldsource ST-1000 Pro.  I chose it because it is simple with only an on/off switch to operate it.  To use it as a step up transformer simply connect a 110/120 V US AC source to the 100/120v input. The front side provides a universal output and a schuko output.  The universal output will accept a US type B plug.The transformer is silent/transparent and in my opinion may offer another level of isolation/protection for the subwoofer.\n","id":"35429578-a8bb-41c1-8fa9-9bbd35b60a69"},{"text":"\n  This is such a wonderful cookbook. The first recipe I tried was the “Mango Nut Squash.” Absolutely delicious! Last night, I made the “Brown Cabbage.” The grocery store I shop at didn’t have the Asian cabbage so I used bok choy like the book suggested as a variation. It was mouth-watering good! At the end of each recipe in the book are nutrition facts: calories, fat, protein and carbs. That is such a great feature since I always seem to be counting calories and watching the fat content of everything I eat. Tomorrow night I’m going to make the “Shrimp Shitake.” The recipes are quick, easy, and healthy. If you like to eat great meals, you’ll love this book!\n","id":"8e06f097-eadc-4dbc-ac02-0a3422a1d69b"},{"text":"\n  As a Trader Joe's devotee I pounced on this title and am happy to report I was not disappointed! If you know the TJ aisles as well as I do you will welcome this clever specialty cookbook that uses items unique to the store. Sure you can make these meals with ingredients from elsewhere but this book makes it a lot easier, especially if you are a dude who shops there and nowhere else and finds the idea of scrambling around town for ingredients overwhelming. This book saves you time because all you need is at your favorite store. It almost forces you to cook! It has completely reinvigorated my diet. Awesome.\n","id":"1a7d203a-06a6-48be-b07d-c5e4d2a8cabe"},{"text":"\n  I was recently gifted a rice cooker and I am not a big fan of just rice. My desire for innovation brought me to this book, and I loved it. The names of the recipes are engaging and fun. Pretty much personifies the food! I love the turkey soup, kung pao eggplant and the mango nut squash. I found the instructions really easy to follow and precise. Even as a first timer, the recipes were simple to use. I like how the author has introduced recipes for different situations, like workouts. Great book!\n","id":"e072af84-f174-4093-bea1-5e0e3987543d"},{"text":"\n  I am a rice junkie, and this book, “Rice Cooker Recipes - Asian Cooking - Quick & Easy Stir Fry - Low Sugar - Low Sodium by Dexter Poin is loaded with great Asian recipes. And not the routine kind of recipes – how about Corn Baby Shrimp Baby or Big Red and there are lots of extras for making stir frys and the Trader Joe’s bonus. I buy a lot of cookbooks, but this is one I’ll be using a lot. Five stars.\n","id":"5ad41e82-c9d0-49c3-88b0-4d84833dfc9b"},{"text":"\n  I had to remove one star because the author didn’t list the sodium content for the recipes, yet the title says low sodium. For people on restricted sodium, it’s very important. On the other hand, I use recipe books for inspiration and this book inspired me. Thanks!\n","id":"6939a7fb-1d22-487d-9cdb-b27568ed4e56"},{"text":"\n  This worked like a charm on the nasty grout in my kitchen. I used a chemical grout cleaner and was able to clean my entire kitchen in 30 minutes. Would have taken hours with a brush and I doubt would have turned out as well. Also used it on my shower walls/floor and was able to get soap scum off that had been accumulating for years!\n","id":"baa367a1-7910-4d6d-a77e-121b7c6cd8c5"},{"text":"\n  I scrubbed REALLY hard to clean out my tub,  but couldn't get it totally clean. Then I bought this, and it cleaned by tub as good as new, with a lot less effort!If I was going to purchase it again, I wouldn't have considered going with slightly tougher bristles to clean it even easier (though that might also damage the surface)\n","id":"31815f6e-881a-4789-85aa-86276123e193"},{"text":"\n  After buying the larger version, this was disappointing. Apparently the color of the bristles means something. The larger one in yellow world's beautifully, this one is is too soft.\n","id":"b3ce26c3-32e1-4058-bfa2-202850b74336"},{"text":"\n  I have used this on my drills and it works soooo good. I have used it to clean my grout on my kitchen floor and to wash the soap scum without having to use to much muscle work.\n","id":"303043d4-e944-4246-990c-36d5e20f8f87"},{"text":"\n  Brush not very durable, didn’t clean the grout. Better job with hand brush.\n","id":"9f88d6cc-c1d4-4dd5-82e6-04cc600e2504"},{"text":"\n  A very high quality and easy to use rice cooker. First of all, it cooks white rice perfectly. It has double lids, which works like a pressure cooker. It only takes less than 20 minutes to  finish cooking rice. Rice is fluffy and tastes very good. I have tried to cook Jasmine brown rice, adding more water and cooking 10 to 12 more minutes. The brown rice comes out so beautifully. Two cups ( the cup comes with the rice cooker) of raw rice can produce enough cooked rice for three adults in my family. Besides, the cooker itself is so stylish and beautiful in the kitchen. Highly recommend. Ceramic is way much healthier than non-stick coating. I love it so much that I ordered two in order to cook  white rice and brown rice at the same time.\n","id":"d8fd0c73-f123-40b0-bbb1-ddb8c443ba3a"},{"text":"\n  I was at an Airbnb, cooking, and pulled a wooden spoon like this out of the drawer to use and loved it. And then it dawned on me that it kind of looked like a rice paddle so I looked up wooden rice paddles on Amazon and here we are. I love cooking with them - I have more of a sturdy and controlled grip than I do with a traditional long handled wooden spoon. I would highly recommend!\n","id":"04b9088e-9f5d-4be1-857b-d513a6b460c4"},{"text":"\n  I love using this for my rice cooker so I that I don't scrape the non-stick surface. It came with a plastic one, but I don't like using plastic. The texture of wood is so much better. Wood is better for the environment as well. The finish on it comes off after washing, but it still looks good and works great.\n","id":"c3cfc8fb-9673-456f-95d3-d8ab1d3743e6"},{"text":"\n  Love these!\n","id":"9314239b-c9a8-410e-ad3b-c55ad0da17af"},{"text":"\n  Priced right. I use one for scooping my rice out of my rice pot and the others for my printmaking!\n","id":"54d2ae50-60c2-44d2-b0bb-c1d1203a4bdf"},{"text":"\n  I had always considered a donabe as a vessel for one-pot dishes, mostly hot pots, soups and stews.  This book first suggests—then proves through chapters divided by different uses and different styles of donabe—that a donabe can be used for many types of dishes.  You will find recipes for rice dishes; steamed vegetables and meats; roasted and fried fish, chicken, pork, tofu, and more; smoked meats, seafood, cheese, vegetables; besides the more well-known hot pots, soups and stews.This is a lovely compilation of Japanese recipes:  Rich, warming, exciting and varied in flavors.  If you are at all interested in Japanese foods and cooking, this is a book you need to work through.  Plus, it has an entire chapter at the end, which gives recipes for dashi, sauces and condiments.It should be noted one of the authors of this book, Naoko Takei Moore, is the owner of Toiro Kitchen, a big seller of donabe cookware in the US.  A good move on her part?  Maybe.  Her website has many styles and pieces of cookware offered for sale.  And quality donabe from the Iga Provence of Japan is not inexpensive.Also on her store website are a LOT of donabe recipes.  I have checked, and except for the basic rice cooking instructions, the 104 recipes on the website do not really overlap those in this book.  Some come close, but they are different.  You might want to take a look at those recipes, because they will give you a feel for those in this book.  And be sure to check out the \"Look Inside\" feature on this product page.  Ten Speed Press always does such a great job with this feature.A real donabe is not mandatory to make good use of this cookbook:  I have been wanting to buy a quality donabe for several years now, and this book has helped me with my decision-making.  The info in this book has also convinced me that my choice to NOT buy an inexpensive donabe from the oriental market was a good one.  In the meantime, I have learned that I can get decent results—not perfect, but not bad—from regular pots on the stovetop and my electric rice cooker.  I even use a huge vintage electric fondue pot from the 70’s with good results.Before introducing recipes, this book will clue you in on how to care for and season donabe, and dos and don’ts for handling donabe while cooking.  It is a very helpful abundance of info.There are many vegetarian and vegan recipes included, and they are marked as such.  There are also options provided to turn regular dishes into vegan dishes.  You will also find suggestions to create a shime course (finishing course) from the remaining broth.  I find some of the shime suggestions to be great recipes in their own right, and suitable for a separate meal.Beautiful photographs of prepared dishes, envy-provoking donabe pots, action photos, scenery.Substitutions are offered in many instances:  Dijon for Japanese mustard, green onions for negi, mushroom and miso options, and more.  Pantry ingredients are not hard to find if you’ve got an oriental market nearby.  If not, Amazon has it all.There are pictures of each dish, sometimes the pre-assembled ingredients, sometimes the ingredients in the pot, sometimes its shime course.The first chapter is a compilation of hot pots using quite a variety of main and accompanying ingredients:  Tofu, beef, pork, fish, oysters, duck, mushrooms, cabbage, gyoza (dumplings), even Korean kimchi, and more.  I loved the “Chicken Meatballs in Hot Sesame Miso Broth”, a two-column list of ingredients, but ingredients that I can find easily at an oriental market or are usually on my pantry shelves.In the next chapter are rice dishes cooked in a donabe double-lidded rice cooker, and it is one revelation after another.  There are several recipes that I will recreate again and again, but my favorite is a small red snapper, just gutted, cleaned and scaled, placed in the pot along with the rice and dashi, ginger, king mushrooms and a few other ingredients.  I also love the “Juicy (boneless) Chicken-Wing Rice”.Love the chapter on soups, stews and braises:  Everything from dried soybeans;  simmered vegetables in dashi and sake, mirin and brown sugar; braised sweet and spicy kabocha; to salt-marinated 1 pound hunks of pork shoulder; miso Keema curry (Indian curry with ground meat); simmered thin-sliced beef with noodles and potatoes; soy and sake flavored ground chicken and eggs over rice.  There is even a salmon chowder—and if you know chowders, you can adapt this recipe to just about any ingredient combination.There are also instructions for using a donabe for a sous vide technique, with a digital thermometer through the steam hole.The donabe can be used as a steamer:  The chapter includes combinations of vegetables, fish or seafood and vegetables and tofu, and sauces.  It provides a custard recipe.  There are rice balls, dumplings, and steamed cakes.In the chapter using a tagine-style donabe, I found recipes that might just “force” me to buy this specialty donabe, (although a lidded heavy skillet already on your kitchen shelf might work):  Roasted potatoes, steam-fried vegetables, steamed clams and vegetables, pork sukiyaki, crunchy lotus root in a vinegar sauce, and many more.There is a chapter on smoking, too.Dashi recipes, sauces and condiments are located at the back of the book, and you will find yourself referring to them often.Sometimes Japanese cookbooks are difficult to maneuver through, with so many foreign ingredients to understand and memorize.  Maybe that statement is only true for cooks with brains like mine, which struggle with foreign words.  But I had no trouble working my way through these recipes.  (I will still take the book with me to the market….)  Plus there is a decent 8-page comprehensive and valuable glossary.There are two pages explaining important kitchen tools and a short resource page.*I received a temporary download of this book from the publisher.  I used it for several months, and when the book was finally published, I bought a hard copy—that is how much I like it.\n","id":"800d9ad1-ec1a-45df-a0e0-bb9531b688a0"},{"text":"\n  I love this book and I'm learning so much from it. Shortly after getting it I cooked my first dinner party for my birthday and it was a great success. I'm up to 3 Donabe and 2 cook stoves and a nice collection of Japanese style tableware. I'm having so much fun cooking from this book and Morimoto's Japanese home cooking book. Thank you Naomi and Kyle, well done.\n","id":"c2383006-e686-4088-a8ea-3f1fc7cb2828"},{"text":"\n  First of all I want to thank Naoko for making this book as I have been waiting for this book since I followed a few of her recepies on her website with great success.I want to try out Japanese home cooking but minus all the technical and time consuming preparations. And, I rather wold like to keep the cooking time to under 45 minutes so we can actually have dinner after our busy day from work.Her book is beautiful. The recepies are very clear. I also enjoy simply reading her stories as well as other important supplements. Most importantly, I find the format extremely outstanding. The ingredient list not only shows the amount but follows the sequence of the preparation. The description compliments the list while added the how-to's and timing. Very clever and easy to follow!!We have now enjoyed many nights as well as friends' compliments to my new found cooking. We love this wonderful introduction to Japanese food, taste, texture and colors. We appreciate the down-to-earth donabe as a beautiful working of a functional art!\n","id":"ffb49b37-242b-481e-80a0-82db45db0e90"},{"text":"\n  I have been reading Naoko's blog and cooking her recipes for some time.  I also own most of Naoko's Iga donabes.  Naoko's blog recipes have always turned out to be not only delicious, but staples in our household.  I could not wait until Naoko's first cookbook came out!  Now that I have my own copy and have been savoring reading and cooking from it - it certainly is several notches above any other Japanese cookbook that I own(considerable!).  I have also been so pleasantly surprised with the excellent general Japanese cooking techniques and sourcing information included in Naoko's cookbook.  I cannot recommend this cookbook any higher.  I just love it.  Buy yourself a copy and learn what delicious gourmet Japanese food tastes like!  It will definitely broaden your culinary horizons.  Terrific job, Naoko!\n","id":"48fb6c32-7959-4748-8f08-0e61cfd397c7"},{"text":"\n  There are a lot of great recipes in this book but my issue with this book is that I bought this book for Donabe recipes.  There are probably about 15 recipes exclusively for Donabe but then the book gets into other types of clay pots (which are called something different like Kamadosan).  Basically if I google Donabe I get plenty of results for the particular clay pot that I have but have very little results for other clay pots unless I google them by name.  This book should be called just Classic and Modern Japanese Clay Pot cooking.\n","id":"18130077-a329-4e6d-b27f-b371afc221bc"},{"text":"\n  I was very excited to receive this pressure cooker.  It is truly a well built item that will last very long.As soon as I did the water test.  I realized that the handle area was leaking steam and would not stop leaking.After doing this test 3 times and getting consistent results.  I realized that the problem was caused by the Euromatic valve located inside the handle. part # 011-631-00-750I looked up images on the Fissler website for this valve.  The valve should have a round white plastic looking tip.The valve on my pressure cooker did not have this component.  It just had a square metallic end.course of action:1)  Research.  I went to the Williams Sonoma store in my neighborhood and looked at their Fissler pressure cookers only to discover that their valves were just like mine! (defective :-)).  Yep.2)  I emailed Fissler Usa.  Got no reply.  I then called them.  I spoke to a lady that told me that I would have to mail them the tiny valve.  They would then proceed to test it in the laboratory.  If in fact it was defective they would send me a new one.I told her that I had spent close to $300 and the valve is $14 retail.  Just send me the valve. . . She said no.So, finally I bit the bullet and bought the valve from the fissler website.  My Pressure Cooker works like a charm.  I plan on using it daily.  Made pulled pork using a pork shoulder and it was a great success.  The cleaning was a breeze.  This thing is a tank!Conclusion:  Buyer beware.  There must be a huge batch of these problematic valves in the US.  Fissler USA needs to realize that and fix it.  The actual product is fantastic though.\n","id":"aa557c17-c4a2-4d79-bc69-d89097690394"},{"text":"\n  Its very disappointing to find after more than a decade of folks complaining about the black top Euromatic valve failures and the fact that they have the solution, a white top valve as shown in their users manual, they are still selling pressure cookers with the old failing valve. If you go this route , be sure to add 20-25 dollars to the total invested in this cooker to buy  the new valve separately. I'll edit this review after the new valve comes in. As it stands it's a crap shoot if the VitaQuick 8.5 qt cooker will hold pressure. In the meantime it is a very nice saucier.EDIT:After spending the extra money to replace the Euromatic valve to the white top, this this pressurizes quick and even holds pressure better. Knowing this makes it a shame they still sell this with the old valve.  If you still have the old black top Euromatic and find yourself watching this PC steam out the handle for a few minutes before pressurizing, do yourself a favor get the whitetop valve.\n","id":"1844332c-e3a3-4313-b662-cb9c50697a7b"},{"text":"\n  30 years ago I was gifted a Hawkins aluminum wiggle-top pressure cooker.  After using it for about 10 years, until it warped, and until I became worried about cooking in aluminum, I upgraded to a Kuhn Rikon Duromatic 7L cooker.  The Duromatic has served us well for some 20 years, though I have always had issues with scorching at the edges, and it's a bit narrow for the amount of food that it can fit.  I was given an Instant Pot for my birthday.  After using the Kuhn Rikon, the Instant Pot was painfully slow to come up to pressure (30 minutes vs maybe 5 or 6 for the Kuhn Rikon), and scorched foods even more than the Kuhn Rikon.  It also decided that food was being burnt and turned off, so I ended up \"finishing\" the food in the Kuhn Rikon.  I don't understand all the fuss about Instant Pots, but on the bright side it means that there are a lot more pressure cooker recipes available (though I still rely on Lorna Sass for most methods). I returned the Instant Pot to the store, and renewed my interest in stovetop pressure cookers.  After reading the reviews of the Fissler by America's Test Kitchen, I decided to give it a try.  Why did I wait so long?!  I did a pressure test first thing (about 2L of water brought to high pressure for 5 minutes), and it worked like a dream.  Quite a bit of machine oil came off with that first trial, so I definitely recommend doing this as well as washing it before first use.  It's much wider than the Kuhn Rikon (about 10 inches versus about 8), and so it's easier to saute before starting to pressure cook.  The bottom is super-heavy and goes all the way to the edge.  Sauteeing is dream, as the heat is constant - more like a nice dutch oven than a regular pan.  It seemed to take slightly longer to reach high pressure than the Kunh Rikon (6 or 7 minutes for 2 cups of rice and 6 cups of liquid vs. maybe 5 for the Kuhn Rikon), which makes sense because it's a lot heavier.  Once it reached pressure, I turned the heat very low, and the pressure remained high - much less fiddling with the heat on my gas stove to keep the pressure even than with the Kuhn Rikon.  The first dish I made was a paella-flavored risotto - no scorching and it was completely perfect in exactly the time noted in Lorna Sass's recipes for risotto.  My husband then made a Korean stew with tofu and beef short ribs - the meat was falling off the bone after 20 minutes at pressure and a natural release.  Amazing!  I like the pressure release button - no more having to waste water cooling the cooker for a quick release, and no more mess.  The little \"hat\" that covers the well surrounding the pressure valve on the Kuhn Rikon fell off years ago, and so water collects in that well when cooling it with water, and then that water spills when taking the lid off.  There is no well on the top of the Fissler, so this would not be an issue, though I don't know why one would use water when the button works so well.  I wear steamproof oven mitts and put a dish towel over the pot to contain the steam when using the pressure-release button.  The pressure indicator is easy to see.  It's easy to clean, though it is really heavy so definitely use 2 hands to move it around.  I expect that it will serve well for another 20 years.  It appears that replacement parts are available, so I will replace the gasket and other rubber/plastic bits regularly.  I waited too long to do this with the Kuhn Rikon, and when I finally did, it made a large difference in performance of the pot.  The Fissler is a functional thing of beauty!  I highly recommend this pressure cooker.\n","id":"dada3467-003f-4294-8c33-47823220c195"},{"text":"\n  Defective.  Failed a 2 cup water test out of the box. The cooker would not maintain pressure, likely due to a faulty valve.If you are in the US and need support for this product expect terrible customer service from Fissler's North American distributor, Roland Inc.  I've contacted several times over the last 2 weeks and have been assured callbacks.  All I wanted was some technical support to troubleshoot the product, but I couldn't even get a person on the phone.  The operator assured me someone would get back to me.  Eventually I did receive an email, but never received a second response.I wanted to enjoy this product as a friend of mine has one and the results were amazing, but I have no choice but to return the product at this point as the deadline is expiring.This 1 star review is a result of a defective product and a bad experience with Fissler's lack of customer service.\n","id":"bd66fe25-6347-4e4f-952b-cc10c528cb0e"},{"text":"\n  My favorite new kitchen product. I was considering an instapot but I am so glad I went with the Fissler instead. I was wondered about the pressure exploding in my face but this is designed so well. It is easy to release the pressure and I love having complete control over how long to cook something.\n","id":"ba0422f6-58ba-45be-b2b6-37c37937450c"},{"text":"\n  Rice cooker in use for about 2 weeks. So far so good\n","id":"fd7832ef-6eee-4342-8adf-e245d04220b3"},{"text":"\n  Apart from creating additional dishes, steaming tray can also act as a food warmer for meals that you intended to take at a later time.\n","id":"91f39636-d96b-4fd7-8a9a-bdd685201447"},{"text":"\n  Only the 240V output worked - but that's because it bypasses the transformer. The 100V output gave 1.2V, and the 110V output gave about 20V!! Obviously something wrong with the transformer. I removed the fuse, and the power switch still lights up with no fuse inserted and 240V output still gives 240V, so the fuse is only for the transformer, it doesn't cover the 240V output.From other reviews of this product, it seems it's just down to luck as to whether your unit will work or not.\n","id":"463cf3a3-c426-4add-8b06-ed0fb0d869f0"},{"text":"\n  I've only used it once so far. I bought it to step down 220v and inflate an air mattress with 110V electric pump - and it did the job. I had no issues with it. It's simple to use, would recommend. Handy to have at home for future use.\n","id":"0b1afade-c0c0-4dcf-8109-cf6347578bab"},{"text":"\n  This very heavy and quite bulky .But it works very well no noise and very easy and simple to use.\n","id":"4cfe2005-18e5-4daf-887c-446e85e9fd50"},{"text":"\n  Item was already rusty when delivered.\n","id":"8e599082-d0d4-4394-90c2-aeea7227088b"},{"text":"\n  Smells like something is burning\n","id":"66670279-a85a-4010-878d-99d593350289"},{"text":"\n  Good\n","id":"e6703652-70e0-4871-8eb5-48c8139c22ba"},{"text":"\n  I wanted a versatile appliance that could replace my stove top pressure cooker and though I havent used the Instant Pot very much, it is a great appliance and easy to use. I havent used it much due to its size, it is rather big for the quantities I usually cook but that's a small quibble.\n","id":"1431be5d-6f53-4415-9bb3-132436ea0b5d"},{"text":"\n  With the availability of free online recipes, it's sometimes hard to justify the purchase of a cookbook. I can honestly say this cookbook has been so great that I'd buy it again, despite the plethora of recipes on the web that don't cost a cent! Not only are the recipes healthy and complex tasting, but they use affordable ingredients.\n","id":"28bc0bd4-0c48-494c-bd1f-b17835828a5a"},{"text":"\n  Great book! I've always loved risotto, but could never make it well. This book showed me how to make perfect risotto very easily.\n","id":"17606d46-301f-4da5-b6a0-a7b229250608"},{"text":"\n  There are some very tasty recipes in here, but the instructions for using the rice cooker as an all-in-one don't exactly work. I have a fuzzy logic machine, and the quick cook function works great for sauteeing - but then the recipe says to turn it off and start a regular rice cooking cycle. The machine will not restart until it is cooled down to almost cold! So I end up either doing the sautee step on the stove, or doing it with the quick cook function and then pouring the recipe into another pot on the stove. Both defeat the purpose of the book, which is to cook everything in the cooker! Any help out there?\n","id":"3da80d71-bc93-452c-ae20-4232d7387489"},{"text":"\n  Ok I gave this book to my daughter, along with a rice cooker, for Christmas.  After she opened her present, next thing I see is my other daughter, my daughter in-law were going through the book and wanting to borrower it.  I appears to have a lot of great recipes ....\n","id":"f6425c74-1eca-434a-b614-059f4073245d"},{"text":"\n  Have only fixed two meals so far, but both were very tasty and worked perfectly for the rice cooker we bought.  Got the kindle version downloaded to our iPad, so just sit it up on the counter and follow the directions.  Very handy.  Some ingredients  are not easy to find, but won't keep us from hunting them down and trying them.\n","id":"749c1440-e922-4694-a475-638b9668058d"},{"text":"\n  Really useful for storing and measuring the grains as it's integrated\n","id":"848040fd-6fcf-494c-af3e-074b371e3e99"},{"text":"\n  User friendly and is a tidy rice storage option. True to description and capacity.\n","id":"8fda3636-cd44-43ea-a3ea-3272ba6763a8"},{"text":"\n  Beautiful baby. Protects my precious rice\n","id":"0e369912-91d7-47f2-a223-eda63627070b"},{"text":"\n  Good\n","id":"40d022e6-63fc-4c94-a28c-54381dccb088"},{"text":"\n  I figured I'd be safe regetting something I'd gotten a year ago, but they completely changed the plastic. As you can see in the pictures, with approximately the same \"squeeze pressure\" the new ones are MUCH less sturdy.The hinges are also thinner, the top is thinner, all around they're much less well made.Will they work? Well, all the shattered ones people complain about are from this new much more brittle plastic. A shame companies can get a good rep with a product then make it much lower quality and coast on the difference for a while!Even though they are false advertising, they do not allow returns. Amazon support will possibly refund, but they're still selling the inferior product with pics of a better one. Stay away. You can get the cheap plastic at a third this much on here elsewhere also.\n","id":"49bea02d-e8be-4b99-a35e-64a46b0e3b6f"},{"text":"\n   Cheap plastic, poor quality, and the worst part is that this container cannot be closed properly (see video). Please do not be fooled by the high score reviews like I was.\n","id":"a1c56657-9fb3-4fba-bb9a-d712889a968b"},{"text":"\n  There were so many good reviews I gave it a shot, but I should've taken the bad reviews more seriously. I filled it to the maximum storage level and on the first time I tried to pour out a cup of rice using the handle, the top latch that holds the top to the container cracked. The flimsy top is very cheaply constructed and does not hold up to the weight of the rice. And to make matters worse, you cannot return this item.\n","id":"705e3ac9-794e-4821-bf47-db62e9c2fce7"},{"text":"\n  I really loved it until it broke a few months after starting to use it. It cracked along the side that is handled. I applied a piece of tape to see if that would secure it but it didn't last. Seems like the material needs to be thicker or more ductile.\n","id":"f819af5b-4c8a-43b4-a8e3-baa80fdde0be"},{"text":"\n  So disappointed.  I actually love this  rice storage container and wanted to order another one for brown rice.  However, I noticed that the container is cracked.  I have handled it only a few times since receiving it  and it should be in new condition.  I am very disappointed, as I would have ordered another just like it!  Very disappointed!\n","id":"ea66e55e-6d93-44a7-9a01-bdd2b7d9b535"},{"text":"\n  I wanted a change from metal pots (as they tend to flake if you scrub the surface too hard and that was potentially be dangerous for health) and came across this ceramic pot. The size is perfect for small family and I like both the timer countdown to when the rice is ready + duration reflection for the keep-warm status. It’s a breeze washing the pot + the detachable top metal cover (down to the silicon ring) is a unexpected bonus. The only downside is congee tends to be a bit too clumpy but nothing adjustment of water can’t resolve. With it delivering great rice (even claypot rice and chicken rice), this is one great find.\n","id":"5c5570b3-57a7-4c5c-9b65-8646d245daa5"},{"text":"\n  I was excited when I purchased this product as it is the right size to make my baby's porridge and the pot is made of ceramic. However, it exudes strong electric component burnt smell when operated, even on the 3rd use. I finally decided to return the item as it could pose health hazard to us.\n","id":"531c81aa-7ac8-4805-928c-8177c676bfa7"},{"text":"\n  I have been looking for a brush that was not made out of wire to clean my BBQ gas grill with because the wire bristles were always falling out of my brushes and sticking to the gilling plates on my grill. It was a big concern of mine because I have heard of people getting these metal bristles on their food and getting stuck in their throat, which worried me and I would always go over the grilling plates with a damp rag to make sure there were none stuck to the them. With this brush I don't have to worry about that and in cleans all the groves and nooks and crannies very well. This brush I would highly recommend to anyone that does a lot of cooking on their gas grill. It's also a big time saver cleaning my grill without doing so much scrubbing by hand. I will definitely purchase another one when this one wears out\n","id":"88c844e8-2ef2-4fde-82bd-592542379407"},{"text":"\n  Will not remove hard rust stains even with commit added for extra scrubbing power\n","id":"aa163150-20fe-49b5-9902-2a22fc39c7fc"},{"text":"\n  This is part of my new cleaning routine!\n","id":"7d0446a0-1dea-4c12-be22-42a140de4cb5"},{"text":"\n  This brush is excellent.  I purchased this and the red style, this version worked well for my purposes (commercial food service equipment) as good as a Nylon brush spinning at a few hundred rpms should work.\n","id":"6af00a05-3404-4b81-81cf-22a67705e33c"},{"text":"\n  I used this to get stubborn thinset off of textured tiles - worked great!\n","id":"7cd03cf9-a5f7-40c7-bd59-a367e98fad4b"},{"text":"\n  I was startled by the size but it works great.Be warned that there is no english on the packaging but Google image translate worked just fine.  That said, boil the napkin before cooking rice in it.  There is a film from the manufacturing process that will rise to the surface of the water and should be poured away.  Between used clean with boiling water and do not launder unless you want your rice to taste like fabric softener.\n","id":"2f90bc77-2443-4565-b69d-ff675f7d88ae"},{"text":"\n  Works but doesnt last very long.  Eventually melts\n","id":"fe18d910-8305-4215-9fb3-b586b0291030"},{"text":"\n  I felt like it was too large for my rice cooker and the rice sticks but it is easier to get out.\n","id":"2ba93d98-10cd-4d9f-84a4-2d3ad75d37d3"},{"text":"\n  Works fantastic!\n","id":"354e13e7-aa34-4f2b-b429-18281d1537a1"},{"text":"\n  Too expensive. Poor quality\n","id":"c00b608c-c0f0-4a3a-a450-b89e9f9a7d95"},{"text":"\n  Extremely disappointed in this product.  It has broken within 3 months of us receiving it despite no external damage.  The one it replaced had lasted 15 years (and was a lot cheaper!) so very unhappy this one lasted such a short time.\n","id":"5d7ffbbd-6e90-4a4f-873a-0e74f3ba1ef4"},{"text":"\n  product is good quality and packing\n","id":"28efc0e6-7375-4382-a031-615334608bde"},{"text":"\n  We are looking for an easy 2 buttons, and here it is.  Simple and easy and nice colour\n","id":"9e6b0477-7d8d-401c-9726-b7ae6bbda4cd"},{"text":"\n  The recipes are not for a rice cooker, as the name would suggest.  They look like perfectly good vegan recipes, but they are not rice cooker recipes, which is what I was looking for.\n","id":"39b0499c-d22e-4fbb-9002-8fc9065ec2e5"},{"text":"\n  I love this. This would be a wonderful gift. If they love cooking or don't but need to cook.These are so nice and easy. Bonus vegan recipes ROCK!  Extra smoothie recipes are seriously YUMMY! I'm going to combine a few and I sometimes cook stove top but I'll mix it up\n","id":"64e9f444-e97e-4aed-a41e-d6feac0e6cb5"},{"text":"\n  Buyer beware! The majority of recipes are for the stove top and have no mention of a rice cooker.  Others are not even cooked items (smoothies, for example).  Recipes are listed in haphazard order and the formatting is sloppy, amateurish and difficult to read.  Book is written under a silly pseudonym.\n","id":"ff789860-513a-4cb1-a0df-217788cf0960"},{"text":"\n  As a vegan living in a studio flat with no kitchen, this book has, (quite literally) changed my life. Mexican Red Lentil Stew, Vegan Jambalaya, Polenta, Chili (several kinds), whole grain cereals, soups and my favorite, Mushroom Risotto. The author also threw in many additional recipes at the end, then added several tasty and healthy smoothie recipes. I highly recommend this book for anyone who wants to simplify the cooking-life.\n","id":"8f7afe0e-6c35-456e-9d3d-e64d7294f3da"},{"text":"\n  I had an earlier model of this bottle with a handle.  Unfortunately it suddenly failed.  I’ve had other Zojirushi products as well so I decided to give it another try.  I like the version with the handle better.  Even with the easy pour cap the lack of handle means this one needs two hands to use.\n","id":"ed207a4a-15c6-46bd-aad9-d65ffde6b998"},{"text":"\n  This bottle  is amazing. Once I put ice in it with a drink and forgot about it. Two days later I was looking for it and it still had ice in it and this was in the middle of summer. I have never used it for hot because I have a different Zojirushi I use for hot beverages which is what prompted me to purchase this one. The one I use for hot does it’s job so well, I wanted a larger one for cold beverages. The only downside to this bottle is the drinking cup is too small and I don’t like the design of the drinking spout so I find that I remove the lid and drink directly from the bottle. This is a minor inconvenience for me and was not worth deducting a star after all the bottle does what it’s supposed to do that’s what I wanted.  Another good feature is I fill it 1/3 with ice and can add 2, 12 oz cans of sparkling water.\n","id":"69058e1d-ca20-4186-b097-170cc11ee908"},{"text":"\n  Zojirushi is a famous brand in Japan. This bottle is of good quality, a nice color, light weight, and does the job. I thought its lacking a handle could be an issue, but it is light and compact enough not to really need one.Boiled water stays reasonably hot for 6 hours. The mouth is big enough to fit ice cubes. The lid is easy to open and close with one touch and stays sealed properly. One slight disappointment is that the lid/cup is a little small and that it is made of a material and shape (a wide surface of liquid is exposed to air) that loses heat very quickly. You go through the trouble to have a warm (or cold) beverage handy, only to have it quickly go to room temperature after pouring it into the lid/cup. Still, I am happy with the purchase and hope to have many years of use  ... just have to drink fast.\n","id":"92cc6908-1132-4f9d-a1d3-b9bfefa9cd2b"},{"text":"\n  This is the second Zojirushi thermos I have purchased. I especially like the one button easy-open spout for pouring drinks without having to unscrew the lid each time. The lid itself screws on easily and seals tight. This model has the carry strap vs a handle to allow carrying over the shoulder while hiking or walking from the car into the office while also carrying briefcase, bags, etc. My original Zojirushi bottle has the built in handle and is still a wonderful thermos after several years of daily coffee use. The button spout still seals tight each time and has never leaked.\n","id":"38d90a12-e400-4d72-9385-1034dc730277"},{"text":"\n  There’s nothing I disliked about it.  Keeps water and liquids cold for up to 48 hours..Put ice in it and the ice is still there after 2 days..it is truly amazing.. Have not tried hot liquids but from what I see it should be terrific...\n","id":"f3d39047-3fcf-434f-aae5-4d7cdbaec8e1"},{"text":"\n  I had the recent pleasure of going on yet another deployment with the Navy at sea. Before leaving my co-workers and I filled the office with snacks and noodles and other microwavable foods because sometimes you just want to work through lunch or the lines be really long.For 4 months we had been heating our noodles in the microwave using the clear Rubbermaid containers. While the noodles were still good, you had to microwave them for at least 8-9 minutes and still they would have this weird taste to them. It wasn't until I was re stocking on noodles and other snacks that Amazon recommended me this little bowl that claimed it cooked your noodles in the microwave in 3 minutes and they would come out just like they would if they were made on a stove.It was cheap and so I decided to try it. OH MAN! This is the way to eat noodles. I had bought two packs of two bowls and ended up giving them to a few of my co-workers who now love these things. DEFINITELY A GREAT PURCHASE. Followed the directions exactly and got perfect results. I am going to recommend this to new sailors when they ask what they should bring on a deployment lol.\n","id":"cddf3ddf-e086-46bd-9068-a8b75bb58a02"},{"text":"\n  Love these bowls. They are the perfect size for the Ramen and my 14 year old son uses them all the time. They don't burn his hands and I'm not worried about them breaking in the microwave. I bought one for him for Christmas and had to go back and buy two more because he killed the first one. One evening he forgot to add water and, oh my, almost caught the microwave on fire. That's nothing bad against the bowls, could have easily happened in any bowl. It's nice to have a couple on hand because one was not enough if we didn't happen to run the dishwasher for a couple of days. My older son laughed at me for buying such a gimmick and told me it was ridiculous to pay this price for a bowl. But you know what, he's wrong, no bowl of mine would stay cool after 3 minutes in the microwave and it comes with the built in line for my younger son to add just the right amount of water. No mess, no fuss, just happy Mom. Well, ok, unless the ding dong forgets to add the water and then you have to air the house out for days. I think I still smell burnt ramen occasionally.\n","id":"d7392620-57e4-429a-b542-5be9209f9c7a"},{"text":"\n  Ummmmm... This thing is amazing. It's a hard, red plastic that cooks one ramen cube at a time.  I no longer have to wait for boiling water.I've never had success cooking ramen in the microwave until this.It is SUPER easy to clean- I basically just rinse and wipe it.I have no idea if this thing is safe for you or not, but it certainly saves time.The only thing I do not like about this, and I REALLY REALLY dislike it, is that the packaging on the front said, \"Reduces sodium up to 50%\".  On the back it said that to reduce sodium, use only half the spice packet. Duh.  WHY would they make a claim on the front that \"healthy cooking, reduces sodium\".  It is so misleading and leads a consumer to believe that the product itself reduces sodium.  I cannot believe they can get away with having that on the front of the package. It makes me feel like this company is a little dishonest.The product, though, is amazing in that it works, the noodles taste almost as good as when cooked on the stove, and it saves me the time it takes to boil water.\n","id":"ddeec05a-ce59-4e28-8d7f-d1b7b039f32c"},{"text":"\n  This thing is legit. If you:a) Eat a lot of Ramen Noodlesb) Are poorc) Just plain too lazy to boil a pot of waterIf you are A, B, or C than this thing is for you. It makes them just like they would be in a pot on the stove.\n","id":"21b85752-a157-456f-8012-3bf7645ed4ed"},{"text":"\n  The directions on the packaging wasn't kidding, cut down on the flavor packets if you are using this to cook the ramen. When you use the whole packet, the ramen will be too salty. The noodles were cooked really nicely, they still had some bounce and wasn't soggy at all. This is great for fellow college students that can't always precisely time or ration the exact amount of water to cook the ramen, or for those who only have a microwave. This makes cooking ramen packs sooo much easier and consistent.The only minor flaw is that since this is plastic, it will sometimes \"hold on\" to flavor/smell if you leave it in there too long, whether it's leaving it in the sink after you eat the ramen, or letting it soak in the dish detergent. You should wash this with minimal detergent right after, don't leave it laying around soaking up the smells.\n","id":"f8b89012-fc00-4c44-954f-151e624793f9"},{"text":"\n  Great heavy duty\n","id":"aba44605-2d3a-4771-a6a3-6005e26ef4d1"},{"text":"\n  The inner diameter of this connector is too large to hold a plug securely. I installed this device vertically under my dashboard to use with my TomTom  GPS unit. The connection is so loose that the plug fell out after the second road bump\n","id":"a0344132-814d-45e6-9dcf-9928353de172"},{"text":"\n  Great idea. Fantastic. Easy to use. Perfect for public toilets or to go camping. Love it.\n","id":"ec7f0a5d-7f6b-4fc3-9fc9-571fe264b316"},{"text":"\n  Works gr8\n","id":"3ac33ca3-ac1e-4a3c-bfc0-f7e3e0a0247f"},{"text":"\n  It's tough to find a flush mount. This offers a factory look by fitting into existing trim. Yes, you need to drill a 1-1/8th inch hole and need enough backing room.I don't like the other products dangling sockets, Or add on panels.I must admit, I would have liked a 4 meter cable instead of 3. This worked perfectly for where I put the socket in my van, but I really should have put it about 2+ feet farther back, and a full loop vs just a sag in the line between the battery and fire wall.Supposedly I have an unused 40 amp power line running to the back, but could not find schematics  before I got this (and I'm missing my tone generator for line tracing.)perhaps I'll buy another for the way back when I find that 40 amp power line.Standard north American 12 volt auto power socket. And the eye ends fit the default ground and positive poles. (default = medium? I think the starter is bigger?)P. S. That  15 and 20 amp description is a little confusing. It should say the 15amp is installed for safety, but the setup is capable of 20 amp service, and comes with two 20 fuses in the packaging if you want to utilize the full capacity.\n","id":"1d3361ab-9eee-4ab2-8341-c2efca41e524"},{"text":"\n  Works great and never disappoints\n","id":"333b5704-c105-47d0-a09f-4c5ee059ebec"},{"text":"\n  Smaller than I thought it was but it is a power little thing! I bought this for my 6 year old daughter for her Birthday and she loves it. We've made pasta and meatballs on it so far. She wants to make steak so will have to try that soon. Boils water quick and cooked the frozen meatballs real quick too. Not a lot of room for noodles in the pan but we did successfully make spaghetti in the end. The hot plate gets really hot,  I know that sounds funny but I didn't expect a kids hot plate to get that hot. It gets hotter than my daughter's mimi's big hot plate.  Other than that,  it is really cute and great for beginner cooking for children!\n","id":"aaa60c86-63c8-4088-a603-b3ab30984b06"},{"text":"\n  I bought this honestly with LITTLE expectations, however this LITTLE cooking set blew my mind at how WELL it works!! As soon as it arrived a few hours ago my 7 year old twins wanted to use it, so they made eggs BY THEMSELVES and were sooooooo PROUD ❤️ It was AWESOME as a parent watch my little humans gaining valuable life skills while having FUN (supervised of course)The “funky new smell” wore off quickly and the eggs cooked perfectly in minutes! I can honestly say that for the price and the educational fun the girls had this is probably my BEST Amazon purchase EVER and would definitely recommend to friends/family\n","id":"7d2b87f9-625d-468b-9ad6-5ecb97637b44"},{"text":"\n  I purchased based upon the reviews I read, what I received in the package was extremely misleading. The cookbook directions is a joke. The plastic useless container is cheap, the tacky plastic apron I wouldn’t put on my dog. I have no idea about the loofah avocado sponge since those thing trap bacteria worse than anything, I appreciate the effort of pointing them in a direction to keep their “pots and pans” we didn’t receive clean but it’s just a filler piece to take up space, trash. The waffle maker is the only positive thing I can say about it, and it gets extremely hot and the oven mite were too chunky and big for my son to use properly(hazardous). If I would’ve received a portion of the items I’ve seen in pictures above, I wouldn’t be such a negative Nancy .. but I built up this package for weeks and it was a prize for him being such a good boy, to only feel terrible from the second he opened it... he was more amused with the bubble wrap. To reiterate, the only item worth mentioning is the waffle maker, thanks to that, everything else was so random, it didn’t go together AT ALL. I plan on posting multiple times, and making sure I get EvERY RANDOM CHEAP item in it, as in hopes... this won’t happen to someone else. I’m a single parent, who has to budget every dollar, I was skeptical to start purchasing things online, since it’s such a hassle for me to do a return, in real life let alone on cyber space. What a shame, and a headache I didn’t need... and now I’m on the hunt to make up for a gift that should have been a great memory, he waited and checked the mail everyday hoping for that and being so patient... not to be redundant, but I am so so so disappointed. Once again, if I had received the package that I was expecting, as all the other amazing reviews from delighted costumers, I would be singing your praises, recommending it left and right to everyone we know, I just really wish it had been dealt with differently.Will be posting pictures -\n","id":"edba455d-90e9-498e-97f7-1a010219ad16"},{"text":"\n  I bought this for my eight year old grand daughter. She loved it.\n","id":"f787c935-66af-4c10-a294-84979d584411"},{"text":"\n  So cute and really great present! Only thing I don’t see is age limit.\n","id":"a8056b26-3ba7-48cf-aa95-e8626ae2fe90"},{"text":"\n  I believe I've made a mistake with the purchase of this cookbook. The rice cooker I have has none of the features of the one they have used - a shame really as some of these recipes sound really tasty.\n","id":"82a607a6-6263-4d0b-93ae-88efc027b30d"},{"text":"\n  Fantasyic\n","id":"9d58b7f4-7e69-4e19-9459-5e837f493011"},{"text":"\n  Why not just use a crockpot?\n","id":"5f9f0e1a-d93d-4e88-bb25-45a840197a59"},{"text":"\n  box was damaged. pot bottom was scratched. i decided not to use it as i thought it was all stainless steel.\n","id":"7098dc15-4ea0-434b-bf14-540175551301"},{"text":"\n  Ok product. It does the job. I use it for dishing out sticky African fufu or rice.  It is truly non stick and works well for this purpose.  Wish the scoop part was a tad bigger. Also the bulky handle takes up storage space. But aside from that it fits the bill.\n","id":"d0581bb3-4408-4a35-bcdb-46de5137ac5a"},{"text":"\n  These are do-able and simple.yet they sound yummy.I want to try the sweet rice pudding it has cherries and pistachios\n","id":"fb48c16f-43e1-43ff-b55a-edc34c1f1def"},{"text":"\n  This is a great recipe book to keep in the kitchen drawer. I usually buy these books on kindle before I buy them in the paperback version to get into the recipes and see if I want to add the book to my kitchen stash. I did decide to add this one for a few reasons. Recipes are easy. There are plenty of recipes that are familiar comfort food, like apples & quinoa and a good recipe for Spanish rice. Then there are a handful of interesting recipes that I haven’t seen anywhere else like pomegranate and mint. This is “a once in a while” recipe that adds a little variety and keeps the kids asking me about new things. All in all, this book is a nice score and I’m glad I found it.\n","id":"0444bcec-c5c3-429c-9691-101caa64c1de"},{"text":"\n  Wish I noticed that it was black and white. It looks like I printed black and white recipes.\n","id":"1a8810cc-4547-4206-b73e-9edced85e27c"},{"text":"\n  Good and easy to cook. Here in europe, the rice cooker is more of a niche product so i had to search abroad.Dexter has been recommended to me as one of the better recipeguys outthere - and his book delivered. All information you need per recipe is included: Clean, straight to the point, period. No flufftalk or 200 pages of stupid talk to fill up pages. Just the good recipes.Thumbs up!\n","id":"9c302389-8715-4aba-90d6-b6210ed15a5e"},{"text":"\n  Only the 240V output worked - but that's because it bypasses the transformer. The 100V output gave 1.2V, and the 110V output gave about 20V!! Obviously something wrong with the transformer. I removed the fuse, and the power switch still lights up with no fuse inserted and 240V output still gives 240V, so the fuse is only for the transformer, it doesn't cover the 240V output.From other reviews of this product, it seems it's just down to luck as to whether your unit will work or not.\n","id":"17ba855c-3499-4bfe-a5d7-f73cb5167e82"},{"text":"\n  I've only used it once so far. I bought it to step down 220v and inflate an air mattress with 110V electric pump - and it did the job. I had no issues with it. It's simple to use, would recommend. Handy to have at home for future use.\n","id":"9c4ce377-5973-42cd-8425-b70f41d047ab"},{"text":"\n  This very heavy and quite bulky .But it works very well no noise and very easy and simple to use.\n","id":"ca1d8377-3d89-46ed-9662-9977620462d0"},{"text":"\n  Item was already rusty when delivered.\n","id":"fdc0ce90-57c4-437e-bb66-348882a08542"},{"text":"\n  Smells like something is burning\n","id":"641a3f86-c08d-47f6-ab88-6556018598f7"},{"text":"\n  Good\n","id":"366ee709-edcb-4d68-aa51-8af38e9ee750"},{"text":"\n  We bought a new Samsung gas range about a year ago. We actually have propane, not natural gas, and it is my understanding that it burns hotter than gas. Well, I've been burning food ever since! Even on the lowest settings we have hotspots in the pans and I have burned spaghetti noodles while boiling them (they stick to the bottom of the pan)! This was driving me crazy.Recently I was looking at a recipe on the NY Times Recipe site and someone commented about using a diffuser on their gas range (the recipe was about braising in the oven and mentioned how cooking atop a gas range made it impossible to cook at low enough heat which is why oven braising came about). Well, I'm so glad I read that comment and the ones from other people who said they use one too,  because I'd never heard of a diffuser for my gas burners and this gadget has changed the way we cook on this gas stove top!I cannot compare this particular diffuser to any others because it's my first but for us, this one has worked great. The one thing I might wish was different is the finish on the top. It is smooth and with some of my pans it's easier for them to move around, so maybe a textured finish would be better but it's not like my pans are slipping off; that has not happened.The handle is removable (squeeze the two sides together to compress it and pull out of the hole, reverse to re-insert it into the hole when needed). I keep the handle in the drawer next to my stove because I leave the diffuser on my second hottest burn all the time. I actually want to buy a couple more but I'd like one bigger one for my hottest burner and I don't think this company makes a larger one. I'll check and if not will buy another brand for that one, but I do plan to get one more 7\" diffuser for one of my back (lower heat) burners. I don't use them much so I'll share one between them.Anyhow, this find allowed me to love our new stove now. The oven is great but I really thought the stove was never going to work out. This diffuser made the difference.\n","id":"83b46480-b408-4af1-b179-2cba8062ec5c"},{"text":"\n  I have had a Braun gas stove for a few years and have struggled to bring my pots down to simmer range since we use propane gas which tends to burn hot.  I had been using an old diffuser that had all the little holes in the metal disk that goes under the pot but still had to keep on stirring to make sure that food didn't stick.  I saw this diffuser while browsing through  amazon and decided to give it a try.  It worked perfectly: minimal stirring (only needed to when I mixed in additional seasoning), uniform heat distribution, and although it's cast iron it heated up quickly when the gas was on medium-low!!  It sits firmly on the gas ring.  The removable handle attaches and detaches easily which I love.  Being able to remove it means that it does not get in the way of larger bottomed pots which causes them to tilt.  I only had it a short time so felt unable to rate durability.  I would definitely recommend this to anyone!  In my book it's a 5+ star product.\n","id":"5ca942ed-0ad4-40ae-b10c-31f81f24dcfa"},{"text":"\n  I got this for my electric range because it worked great on my mom's gas stove. And the product description clearly states, \"evens your electric or gas burners heat surface.\"  But this is NOT true -- unless you discount the horrible blistering and flaking that occurs after just one use. See my photos in the customer photos.\n","id":"aba4351b-0d33-4417-94ad-b7dddd048770"},{"text":"\n  I have been looking for awhile for a way to use some teapots with bottoms too small to go on my gas stove top. This is perfect.  It's extremely stable, provides a level surface for my little pots, and is not at all heavy despite being cast iron.  I'll attach some pictures so you can get a sense of how it looks with a standard gas burner.  Also, I realized after using it that I'd underestimated the value of it's feet, which keep it from sliding around on the burner when putting items on it. The third image is of the ring upside down so you can see it's low feet.  The more I use this reducer ring, the better I love it.  It's a quality item, highly recommended, especially if you can get it at the add on price!\n","id":"9252ce08-6e18-4543-82a1-9df27b17c50f"},{"text":"\n  The ring has built-in tabs on the bottom that allow it to be centered over my gas burner without movement. Without this ring, the large spaces between the burner ring would allow the Moka maker to possibly tip over. Perfect!\n","id":"fbc14fbc-1155-43a2-b92e-36b32132a2fa"},{"text":"\n  I really love this little rice/grains pot.  I have a lot of other Le Creuset pieces so I wasn’t sure I should get this (since I don’t eat a ton of rice)  but I’m glad I did.  It’s a really cute shape and the interior is dark (like the frying pans) instead of the traditional light colored interior and so far the clean up has been really easy (I ordered the white and the exterior doesn’t discolor either). The rice doesn’t stick like crazy like it does in other pots.  The interior lid does seems to keep the rice water from bubbling over while cooking which was the major selling point for me.  I’ve been cooking more rice since I purchased this cutie and discovered that I prefer Jasmine rice to the extra long grained rice I’ve been cooking for years so that’s an added bonus.  Also discovered (as a general rice cooking method) it’s best to rinse the rice before you cook it and I wasn’t doing that before either.  Anyway, I highly recommend this little rice pot if you are on the fence.  You really can cook anything in it, not just rice and grains.\n","id":"3173631b-dd0d-42ba-9cf2-6a06a7770549"},{"text":"\n  I wish I had one of these years ago. Threw out the old electric rice maker. Perfect rice is a breeze with easy cleanup. The stoneware internal lid is a big part of the functionality but I’m afraid I may break it. I’m sure they make a replacement if it does.\n","id":"e396877c-4907-4679-bd1b-d547f85fd87e"},{"text":"\n  I love this rice pot! I have burned many a pot making rice but no more - this is so easy even I can cook with it. And rice isn't the only thing I can make in it. Check out the Le Creuset video on YouTube and start enjoying rice cooking!\n","id":"5f77c37e-425b-42a0-9f26-0fb2760e90fd"},{"text":"\n  Excellent rice cooking pot - much better than a simple heavy pot on the stove. No instructions came with the pot, so it does take some experimentation. After bringing to a boil, 10 min cook on the lowest setting, turn off the burner and let sit for 10 min, produces a very nice rice. Add 2 more min on the boil and down’t turn down as far and you get some crunchy rice against the walls of the pot - YUM! Stovetop mess is greatly reduced. I still get some steam condensation dribbling down the sides of the pot with light drops onto the stove, but nowhere near the gummy mess with a standard pot.  I do wish it was a little larger. I push capacity at 1-1/3 cup of rice. That is all it will take.\n","id":"1c00234f-7910-478c-8020-b8c6b59cef00"},{"text":"\n  this product is simple to use and works like a charm.  I never cooked rice before and just followed my youtube instructions and I made excellent brown and white rice.\n","id":"863d4e51-30e7-4e63-aca0-d305dd542ecb"},{"text":"\n  I am using this to scoop solid coconut and palm oils for soap making.  It works great.  Easily cleaned and so far is holding up exceptionally well.  I first thought was that it would bend easily, but so far not the case.\n","id":"a5fb252a-d2f6-4163-9569-8635676d22d2"},{"text":"\n  Very satisfied with the product.  Quality is top notch.\n","id":"0dbc0780-dd61-44a4-ab93-238c94d8ec21"},{"text":"\n  I ordered 4 different types of ‘Elvissmart Himalayan Rice’ at the same time and I am reviewing them all together.  When I ordered them, I was looking forward to comparing the various varieties.  I lived in the Himalayan foothills for a while when growing up and learned to love rice there. Here is what I ordered: > Elvissmart Extra Long White Basmati Rice - Premium Aged, 10 LBS, Healthy Grain > Elvissmart Premium White Basmati Extra Long-Grain Aromatic Rice Variety, Fluffy & Quick Cooking, 10 Pound Bag > Elvissmart Extra Long Basmati Rice, 10 Pound, Aromatic > Elvissmart Himalayan White Basmati Rice-Naturally Aged, Double Polished, 10 LBS BagThese were separate listings, different names, different prices. They have all arrived and I was disappointed to discover that all the bags of rice are labelled identically aside from the different product numbers.  40 pounds is a lot of rice! That is 428 servings in total according to the info on the bags. That would be fine since I love Basmati Rice but unfortunately this is not high-quality basmati.  While it is a pleasant long grain white rice, the ordinary 365 brand white Basmati that I get at Whole Foods is much longer grain and very much more aromatic.  This is not terrible rice, just not great.  I’m not even sure it is actually Basmati since it does not have the typical wonderful aroma of Basmati.I tried several methods of cooking the rice hoping to bring out the aroma And I tried cooking some of the rice from each bag.  By the way, the bags are very thin and rip easily so you will want to be prepared to transfer the rice to storage containers right away.  I used large glass canning jars.First, I used my usual absorption method and usual measures for cooking basmati and the result was too hard and dry, possibly because of the extra aging.  I added more water and cooked quite a bit longer and it was okay, though not aromatic, and not extra-long grain.Next, I tried the traditional Indian method which I have not used in a while. I cooked the rice like pasta in lots of water, then drained it through a fine strainer. This worked great although I did have to boil it for 15 minutes (which is much longer than expected) to get the right texture. Very fluffy results though not aromatic and not extra-long grain. ***  This is the method that I recommend. ***Lastly, I tried soaking the dry rice overnight in lots of water and then draining it and cooking it using the pasta method.  It was fine but no better than skipping the soaking. It did cut the actual cooking time in half.I had forgotten how convenient the pasta method can be for cooking rice: No need to rinse the dry rice since you are using lots of water. No need to measure carefully since you will strain off the copious extra water at the end. Easy to clean cooking pot. And nice fluffy results.\n","id":"b9c3058e-9211-490d-b869-0b266ba6f240"},{"text":"\n  Summary: This long grain rice is aromatic and flavorful. It cooks up soft and fluffy, and can be reliably cooked to form a crispy “tahdig” or “socarrat” layer.My experience: First, let me say that i bought more of this delicious rice! I didnt look closely at the labels in their listings, and i thought i was buying slightly different varieties, because the listings changed the wording a little. So several of my reviews are the same, because it’s the same rice!I never knew rice can be a satisfying main dish until friends cooked some basmati rice and created a crispy but still light “tahdig” layer under it. This basmati is as fragrant and flavorful as that, and i have been able to consistently cook delicious dishes by soaking this rice, then boiling, then simmering while the water evaporates, and learning how fast each pan and stoves cooks. You want to control the last few minutes carefully if you want a perfect layer of crisp tahdig or soccarat, and this rice can do it because the rice is well screened to give consistent results. Until you do that, you wont know how precious and delicious each long grain of basmati rice can be. My photo? Dont worry. I ate that last grain, too!My friends told me a secret to creating a tahdig layer, and they said they prefer long grain basmati, instead of this extra long grain. Because they are experienced, the technique they showed me worked perfectly with this rice! But they asked me to say that, if you are not used to cooking with “extra” long grain rice, you will have to modify your usual soaking time and cooking time and even the amount of water. And the pan matters! And the stove! I have new respect for those who cook a perfect tahdig or socarrat every time.5 stars for great tasting, aromatic, evenly sized, unbroken grains. So i bought more than i intended? No regrets! I love this and will be sharing with friends and family!\n","id":"a6fce41f-9042-4c3a-97ae-88acf2d12211"},{"text":"\n  My mother and I don’t eat much rice, but I’ve heard such wonderful things about basmati rice so I had to try it.This is a HUGE bag and will likely last us a VERY long time.One HUGE issue – as I was trying to stand it up to open it, the bag split clear down the side on the counter and I lost about 1-2 pounds of rice (I saved about 8 pounds). Cleaning it up was a nightmare after almost slipping in it.So, care must be exercised when transporting this bag. That’s where it lost a star – packaging.Another star was lost for … no directions. I am not kidding. There are NO directions on this bag. The sticker on the back was only covering up a bar code.I had to find this brand elsewhere to find the instructions. They do have a few typos, but they work. I used the closed pot method.Aroma? WOW! Even as it comes to a bowl, this smells WONDERFUL! And, even my mother said “that smell draws you right in”.Fluffy? It cooks up absolutely fluffy.Taste? I added a little bit of butter and this rice was wonderful!This was my first time cooking rice. I used a 2 qt pot which BARELY worked. I only used 1 cup of rice.Overall, I am pleased. I would suggest, for this bag – better packaging and instructions.\n","id":"f2a4ec0e-85fe-44f9-b1c5-dff77b6d3d65"},{"text":"\n  Very fun decal! Put it on my 8 quart Instant Pot....\n","id":"0e5be65a-a932-4156-9291-cee32a40f207"},{"text":"\n  Fits my instant pot perfect. Now everyone will know that their drinner was made with love and other ish. Easy to peel and stick.\n","id":"4f794286-6e06-453a-81ac-f93492140f24"},{"text":"\n  Hahaha get a lot of laughter with this one\n","id":"fed00ef7-f4c8-424c-af26-045b2b1d9238"},{"text":"\n  Arrived quickly and stuck like a sticker. Awesome!\n","id":"313466e2-9fb1-4c42-82cd-543b87a09d75"},{"text":"\n  Went on easy and looks great!\n","id":"71d025cf-cde0-41a5-acfb-06f7d1460981"},{"text":"\n  This reminded me of raiding a friend's recipe collection.  Very chatty, but the recipes have very little explanation, many have one-step: put everything in rice cooker and turn on.  While quick to read, my rice cooker has a lot of settings and it won't be quick or easy for me to figure out which one works the best or what to expect from each recipe.  So I guess I get to do the actual experimentation, which isn't what I expect from something I paid money for.  From the ingredients in the actual cooking directions (cheese in a 100% Vegan Approved cookbook?) differing from the listed ingredients, I wonder how much actual testing went on as opposed to someone scribbling down what they did after the fact.  I could find more than 50 recipes like this online for free in a few minutes of googling.  I choose to use cookbooks because I prefer the guidance people with more knowledge of ingredients and appliances than I have, so I regret not putting my hands on an actual copy of this first.  If a friend had emailed this to me as a file of recipe ideas, I would be stoked.  An edited, tested, cookbook this is not.\n","id":"50cac155-263f-44db-9123-fb794a7de186"},{"text":"\n  Delighted with this rice recipe book. I've always loved cooking with rice having had an award winning rice recipe handed down through the family and using brown rice as a healthy meal base staple. I discovered many new ideas that I will use in this book. I especially loved that the meals are not only delicious food combinations thy are nutritious, affordable, and easy to prepare. A well deserved 5 star for this one.\n","id":"05219ffe-e3b3-4e4f-8a0b-6a077cba61f3"},{"text":"\n  Simple. Not many photos but easier to use with my basic $20 rice cooker versus a more delux book that caters to more sophisticated rice cookers, has more photos, and rice variations. This is just what I wanted for a fair price. Some additional receipes for a gluten free person who eats a lot of rice and loves my cooker as the rices come out perfect every time. I also am just learning how different in taste and texture there are of many rices. Having easy tasty fun...with what was boring brown rice.\n","id":"7353d205-af76-49d4-8b5a-5e822eecb93a"},{"text":"\n  Rice Rice Baby by Author Dexter Poin is chock full of delicious rice recipes for vegans and all others who enjoy nutritious and tasty food. My daughter & her children are vegans...therefore, I will be happy to share these recipes with them.  I personally don't own a rice cooker but after reading this author's take on the benefits of using one and with the recipes provided, I think it will be a new addition to my cookware in the not-too-distant future.Also, I really enjoyed getting to know this author a little better by his preamble at the beginning of the book. It gives a glimpse of his sense of humor before he sets out to share a wide range of recipes with his reading audience...50 rice recipes to be exact. You certainly don't need to be a vegetarian or vegan to enjoy them. There is a vast array of recipes which are sure to appeal to pretty well any palette. Just to mention a few, some of these are Veggie Rice, Black Bean Soup, and even Banana Coconut Sticky Dessert.  The pictures of the prepared product certainly add to this recipe book. I like the bonus tip or Variation included at the end of each recipe which suggests possible substitutes to an ingredient or other helpful cooking hints.Inspirational Author & Book Reviewer ~ Dolores Ayotte\n","id":"1740fbfe-16c7-456d-a8a6-248af3531647"},{"text":"I'm Not Perfect and It's Okay","id":"3866df79-3b05-4502-8c62-fa7de4a2dc7c"},{"text":"\n  The breakfast burritos were amazing. I really loved this book. The recipes are easy and delicious!\n","id":"b29405da-3f5b-48f7-80f9-c161c0bbfd25"},{"text":"\n   If you don't have easy access to a real stove, and you do a lot of microwave cooking, this is a great tool.  Good for rice, pasta, microwave chicken.  Also good for just storing things in, and for mixing things like salads.My complaints are that if you get several, they don't stack inside of each other very well.  And it says it can do 12 cups of rice, and while it can do a lot of rice at once, if you did 12 cups, the water would overflow in the microwave if you did 12 cups at once.\n","id":"2cc85b90-ed2f-47d2-8058-eb1662e7ce4b"},{"text":"\n  Bought this for someone else who's having a hard time getting good rice out of their countertop rice cooker.  I've had a few similar to this growing up and even currently throughout my life and I do this would be an easy reliable option.It works as expected. Had zero issues with any kind of melting or weird burn spots even in a tiny microwave is that the size is almost too big for.I really bought it mainly for just making rice but it comes with so many accessories which is really cool. the person I bought it for also didn't have any measuring cups or spoons so this was great for the price to include measuring utensils and a steamer basket and tray.For simple Rice my recipes always been 2 cups long grain rice, three cups water, a tablespoon of oil, teaspoon of salt. Wash the rice at least three times and strain it.  After the final rinse pour in 3 cups of cold water and the oil and salt, give it a stir put the to lids on and pop it in the microwave for 20 minutes.  once it's done you can leave it in the microwave OFF a few more or take it out and set it on the counter and let it sit for 5 minutes then fluff.Perfect rice every time. At least that's how my mama showed me a long time ago and I've always loved it.Stores in the fridge easily in container and can be reheated that way with a splash of water. for reheating rice though I definitely recommend only taking the portion that you want and heating it instead of reheating an entire container multiple times.\n","id":"71bfadaa-2d7b-46dd-a5be-31318241be54"},{"text":"\n  I have been making rice for a long time.  I made it on the stove and boiled it over many, many times and then moved to a rice cooker which made excellent rice but was a huge pain to clean.  When my rice cooker of many years stopped working, I started looking for a replacement with the specific feature of being easy to clean.  After a lot of looking, I stumbled upon this microwavable cooker.  I was pretty sure that the rice wouldn't be as good as making it in the rice cooker - but I was wrong!  The rice turned out perfectly and the cooker is super easy to put in the dishwasher - no mess!\n","id":"d630e5fe-4e5e-456b-b3f6-4381255e2530"},{"text":"\n  I made 8 cups of rice, used the measuring cups that came with it. 20 minutes later I got nice fluffy rice. I had a smaller generic one I bought at a thrift store that worked the same way. I opted to get this one because I needed more rice. Also fit in my microwave.\n","id":"6c4a6ca1-e875-4349-b1e2-2ef9257256cd"},{"text":"\n  but follow directions closely. This product steams the rice in the microwave and mine came out perfectly, much better than my old electric appliance. My experience with cooking pasta however, was not as successful - the pasta all stuck together. If making rice is the objective then I highly recommend this purchase.\n","id":"55f9d56e-081c-4a2e-acbd-be38379df673"},{"text":"\n  For the first 2.5 years or so, this pressure cooker set worked very well.  We used it frequently and it got the job done... But then it began leaking steaming water from the sides.  We replaced the inner ring seal and it worked fine - for a month or two, then it would not build much pressure so we replaced the other seals - the seal for the pressure indicator and for the safety valve.  This has fixed it for the past month to six weeks.  Now it has failed again - so while the pressure cooker set works great with quality seals - and replacement seals seem NOT to be of the same quality as those included with the actual pressure cooker set but they are nevertheless EXPENSIVE.  Since I have no desire to spend a fortune on flimsy replacement seals every few months, I will be looking for a new one; preferably one that requires fewer seals and has better quality replacement seals available.\n","id":"756e1908-c58d-4261-928e-9534957c4bf9"},{"text":"\n  Material quality not good. Purchased pressure cooker in January 2018, within few months we had to replace sealing ring and side handle!\n","id":"7b75f499-d3eb-4c03-9313-24ff6e493520"},{"text":"\n  I bought these pots as I needed new pots with less cook time.  So I went for the pressure cooker.  The stainless steel quality is superb not to mention the thickness.  The glass lid also fits well with the pots.  I like those!  These sets are also perfect for cooking without pressure.  I first had trouble assembling the handle with the pot.  However, I noticed that it was due to its perfectly designed structure.  It was very well made to fit the pot without error.  I am very impressed with how a pot can be designed as if you're assembling a device.  If I had one issue, it was a gluelike mark around the safety valve.  Cooking time is reduced by half the usual time with proper water measurement!\n","id":"742af068-66b2-463d-aad8-1d1d77073b51"},{"text":"\n  great set, I use this pressure cooker for almost everything, the 2 sizes are great from when I want to cook bigger batches. I had a really old pressure cooker and always left the kitchen afraid it will explote or something. Now I feel very safe, they look beautiful, quiet and with so many safety features that there is no way the can go wrong\n","id":"c96eec41-2af5-4d0b-adb3-c3b7a21988c0"},{"text":"\n  Pressure cooker is a must have in every kitchen and this one is expesive but great. I am enjoying it. I thik its the best out there in the market.\n","id":"6bc56f49-2947-4cbc-ac6a-3213fb68ce09"},{"text":"\n  I just got this and I just read the directions and you have to soak this rice and rinse it before cooking. I didn't realize this as this wasn't on the directions for cooking it on the website. I DID look for this to be mentioned somewhere before buying. I didn't want rice that I had to go thru all the hoopla about.  I'll try this out and update this in a couple of days. I'll keep it now that I've got it. Can't do any better now. Too late.Update: 31 August 2017- I made the rice tonight. It came out fantastic! I upgraded this review to 5 stars. My mother loved the rice I made tonight and couldn't stop talking about it. I actually made 2 cups of rice to 4 cups of water and it came out so much rice! It was to the top of my 3 quart pot. I put turmeric in it and some fresh parsley, butter and a little low sodium salt. And it was perfect! I did follow the directions and I soaked the rice and rinsed it really well. I cooked as directed. So I'll be using this until it's gone and I may order some more. The grains are really long when it's fully cooked. Next time I'll make less rice. I didn't know what to expect and is why I made what I did. I didn't know it was going to blow up that big in the pot. It's REAL BIG! So definitely less next time. Highly recommend if you don't mind soaking and rinsing your rice. Some people just want to cook it and get it over with. So if you feel this is YOU, then just give this a try and see how you like it. The taste is good!Update: 20 September 2017- I bought another one of these containers of rice, cos the first one was so good and I'm almost out already. Nice rice even with all the fuss.Update: 23 September 2017- I made some rice and took a picture. I made beef rice with this. Instead of making plain white rice, I took the beef stock I had cooked and reserved it. And I used 2 1/2 cups of the beef stock and a 1/2 cup more of water (3 cups total) to 1 1/2 cups of rice. It came out very tasty! I did the same thing using chicken stock I had reserved as well. Same results- it was really good- Lots of rice too!Update: 27 September 2017- I started cooking some more rice and it had a really bad rancid smell to it. Had to throw the whole pot of rice away as well as the rice. I don’t know what happened to the container. It was just sitting there in a cool place. So maybe it’s expired or something else going on with it. Now I’ll have to buy another one and hopefully it will be ok. Downgraded from 5 stars to 3 stars now.\n","id":"7a313f42-06d1-4c5b-a112-348803e67a17"},{"text":"\n  We have been using this brand of brown rice for over a year now. We also mix some other grains in it, tastes great (Pride Of India - Organic Red Royal Quinoa - 100% Bolivian Superior Grade Protein Rich Whole Grain, 1.5 Pound (24oz) Jar)As for cooking the product, the directions on the box are not very helpful and neither are correct. The rice will not cook if soaked for 15-20 minutes. We generally soak the rice overnight before cooking it. Water used to cook is 3 times than the quantity of the rice (One cup rice and three cups water). Brown rice generally takes more time to cook than white rice. Hope this tip helps.\n","id":"0fd920f2-701c-48f4-9dc6-26b22f0e689e"},{"text":"\n  Everything it says it is. I was pleasantly surprized with everything about it... extra long grain like I like, cooks up just right (no unpleasant surprises), aroma is very nice (dinner guests love it).I have been using nothing but this rice for a couple of years, and frequently make it just to fill the kitchen with it's wonderful aroma; of course, I eat it too. Before experiencing this rice, I hardly ever ate rice; just wasn't my thing. Now, I prefer it to French fries or mashed potatoes.There is another product sold on Amazon by the same name and has the same packaging that has very poor reviews, and sells for less; weird. I have no idea what that's all about, but I can vouch for this particular one as being of high quality and value.RECIPE:Rice, Basmati... the better rice★★★★★Prep 30 mins ∙ Cook 15 mins ∙ Makes 3 cups cooked riceINGREDIENTS:1 cup Basmati Rice2 cups water½ tsp salt (or to taste)splash of oil or bit of butter⅛ tsp turmeric (optional)DIRECTIONS:Using a strainer, gently rinse rice thoroughly with water to remove excess starch. Carful... the rice is britle and breaks easily. We are trying to get rid of small particles, not make more... easy does it.Soak rice in cold water for 30 minutes for softer, less brittle rice.Drain well, and transfer rice to pot with a good fitting lid.Add salt and butter to the rice and toss gently; gently. The butter not only adds flavor, but helps prevent the water from boiling over.Boil water in a seperate kettle or pot, and pour over the rice.Set pot over medium-high heat. When water starts boiling and steaming again, cover pot with tight fitting lid, reduce heat to just above it's lowest setting, and let rice cook for 15 minutes undisturbed.After 15 minutes, remove pot from heat, with lid still on (no peeking!); let rice steam another 5 minutes.Uncover rice, fluff it up with a fork.Fun with Tumeric:To add a bit of color, mix ⅛ teaspoon turmeric with a tablespoon of water, then add a handful of some still hot rice to the mixture. Then mix this rice back into the white rice.RICE Comparison:→Jasmine Rice (sticky)Jasmine rice is originally from Thailand and commonly used in Southeast Asian cooking. This is a long grain variety of rice that has a subtle floral aroma and a soft, sticky texture when cooked. The grains are also shorter and thicker than basmati rice.Before cooking it's important to wash all types of rice to remove dust and excess starch. Jasmine rice is traditionally cooked by steaming or using the absorption method, which simply means it's cooked in a measured amount of water which is completely absorbed by the rice.→Basmati Rice (non-sticky)Basmati rice hails from the foothills of the Himalayas in northern India and Pakistan. There are some varieties grown in the U.S., but they aren't quite as good as the imported varieties. This is a long grain variety of rice commonly used in Indian, Middle Eastern and Persian cooking. Basmati rice is commonly available at most grocery stores and is available in both white and brown varieties.Basmati rice needs to be soaked for at least 30 minutes before cooking. This allows the grains to absorb water and cook evenly without breaking. Basmati rice is traditionally cooked by boiling it in water.→Texmati rice is grown in Texas, and is a cross between Basmati and Texas long grain rice. We prefer Basmati over Texmati. To my taste, Texmati is missing length, fluffiness, aroma, and flavor compared to... okay... Texmati sucks compared to India Basmati. Although Jasmine is similar to Basmati and pretty good in it's own right, Basmati is a hard act to follow.→So... rinse and repeat to give either rice a thorough washing (carful not to break the grains... easy does it), then soak for at least 30 minutes to prepare it for cooking. Skipping either step will result in an end product that will surely disappoint. These fancier rices are a far cry from Minute Rice, and the other common, everyday rices most American's are used to. They require a lil' extra effort and care to prepare, but the end result is oh so worth it.I hope this helps.\n","id":"b58ad23d-33e6-49f4-9196-0260f70fce63"},{"text":"\n  I usually buy basmati rice in large sacks at the local Asian market but wanted to avoid a trip and ordeered this rice to try. I was also operating under the false information that basmati rice from India is less likely to contain arsenic than rice grown in the United States and it turns out this is a PR campaign from the Indian government that does no testing of its rice and simply claims that no rice with arsenic is ever exported.I now realize as well that most of the basmati rice from India is from a genetically modified strain and this GM rice is more likely to cause intestinal upsets and is possibly carcingenic. So no reduction in arsenic and a dangerous lab modified genetic structure has led me to buying rice being grown in Thailand. The Thai rice is better tasting as well as much healthier to consume.\n","id":"acc09c4d-6e01-47fa-b8df-d67dab7f606f"},{"text":"\n  I have a steamer/rice cooker. I have make many brands of white, brown and wild rice. This rice would not cook. The directions do not state any cooking time. I cooked for 35 minutes it was not cooked, added another 10 minutes, still not cooked. Through all rice away. If it will not cook in 45 minutes I don't want it. Garbage....\n","id":"5b93f0ea-6dbd-4477-b122-e2122acafaef"},{"text":"\n  Purchased this item with the Placematix Kids mealtime set. Placemat is a very nice size. Nice vibrant color and sturdy product. Would purchase again.\n","id":"16ed71ac-debb-4ea8-b3e7-ffe707fd72d8"},{"text":"\n  So good\n","id":"274627de-a51f-4c43-8269-8028d9896c1b"},{"text":"\n  Of course it takes group of guys to come up with the idea of hiring drill to cleaning chores! :)And it works!Few months ago I spend about two weeks trying to get rid of years-old film of dirt build on our kitchen titles.I got mediocre results and was not happy at all.When I have found this product on Amazon I knew it'd gonna work!  Drill is a powerful tool, applied to tiles - did the job beautifully. Great idea, saving time and elbow grease.\n","id":"95f81cbc-1ba1-441e-b6c8-0581fad9314d"},{"text":"\n  Those things clean everything. And I mean everything. The tub to the floor mats in the vehicles. They work wonders and get into areas you normall can’t reach. Recommended to my friends.\n","id":"440181d3-c7f4-49bc-ae04-8691fc64c698"},{"text":"\n  I used the giant brush to clean the base of the tub and a smaller one to do the caulked tile shower wall. I think this works really nicely to replace extra elbow grease but you still get the benefit of the 'deep cleaning work-out' because you're exerting strength to keep a drill steady. Recommend, and buying more as gifts for a house warming and part of a useful-stuff-wedding-gift-basket.\n","id":"affff35b-1bb0-416a-8aa5-e7689b62d025"},{"text":"\n  These drill brush attachments are awesome!  I have severe arthritis in my hands and wrists.  These nifty small brushes really save me a LOT of time while getting things cleaner than I could do by hand.  I bought the brushes with the extension, so I can reach pretty much everything.  I am so happy I found these!  They clean up in a snap too.\n","id":"e493dd28-0223-4aae-a435-21b957ddf5cf"},{"text":"\n  I have used these brushes all over the kitchen and bathroom since recieving them.  The different sizes make the set very adapatable for different areas.  The brushes are moderately soft and have not damaged any surfaces.  They rinse off easily.  After several uses I have not seen any bristles come off or any signs of wear yet.  The only downside to drill powered brushes is that at higher speeds they will fling whatever is on the brush quite a ways, so plan accordingly.\n","id":"d51f105f-b48f-440d-955c-ea9fb4bddb38"},{"text":"\n  Being new to pressure cooking this book is very useful.\n","id":"2eb75b06-fd50-4bfc-9846-a566397b7571"},{"text":"\n  I wanted to buy a pressure cooker and my husband convinced me to try an electronic one and he chose this one.  It arrived very quickly and I've learned a few new recipes using instant pot.  It made cooking large chunk of meat very easy, so I started to cook pork knuckles,  beef briskets and whole duck.  love it.\n","id":"cbe9a311-dcd1-41ff-9d7e-68375486c64b"},{"text":"\n  I recommend this book to anyone that is thinking of living this lifestyle. I know for me it change my life. Three years and counting. I am healthy and happy.\n","id":"a9bc13ac-35d0-4cf9-8f2c-205f933b4171"},{"text":"\n  This was more for an instant pot not my rice cooker that is small and only set up to cook rice or steel oats\n","id":"d87d6520-13fd-4435-850d-0b5f88f92c2e"},{"text":"\n  I'm trying to eat low carb, and debating whether it is worth keeping my rice cooker. I just browsed through this book. There are a few keto/low carb recipes. Maybe 10-15% of the recipes in the book. The majority of the recipes feature rice, noodles, or wheat flour. Several of the rice recipes have nutrition counts that have to be way off (super high in protein with no meat or other high protein foods included in the recipe, and pretty low in carbs for a carb.) This leaves me suspicious of the nutrition information included with the other recipes. These may be fine and tasty recipes, and everything seems written clearly enough, but the contents not do what the title and premise of the book say they do!\n","id":"65e5d156-ec32-4287-89e4-7bb477cb057c"},{"text":"\n  This was amazin book. I am glad to purchasethis book.  I will suggest every one.\n","id":"3233cd8a-5f2b-4676-bec8-6c481b6a6878"},{"text":"\n  I have only tried this with sushi rice but it comes out nice or soft sometimes a little bit wetter than it is but I don't mind (although not sure if that is how everybody wants). Although I do not know a bit about japanese words since all of the instructions are in japanese (no english translation), I just made the directions based on my assumptions on the pictures that the box shows so I am not sure if it is as accurate but its better than nothing. Do not bash me if I am wrong, used this as tips or advice. Do your own trial and error on your type of rice you are cooking.Directions1. The first step just seem to be telling you how much rice you want to cook or prepare like between 0.5-2 cups of rice (minimum and maximum amount you can make I assumed).2. Second step as most likely any asian would do is the washing and rinsing step. As the pictures shows, you wash the rice then pour and strain the water to remove most of the starch in the rice.3. I think the third part is putting in the amount of water needed for the rice to be cooked, I recommending adding a half a cup more or 1 more cup (preferably for sushi rice or softness). CC as I believed could stand for cubic centimeters so try converting that to ml. Do your math.2 cup=420cc (approx. 2 cups)1 cup=220cc (approx. 1 cup)0.5 cup=120cc (approx. 1/2 cup)4. The fourth part consist of how long you cook the rice in the microwave. Every rice varies so make your own assumptions.2 cup=13 mins (15 mins is ok but will be very hot on the container)1 cup=9-10 mins0.5 cup=7-8 mins5. After it is finished and you  take it out of microwave. Let stand for 15 mins to cool down.Like I said used this as a tip or reference. Trial and error with your own rice or food. White rice, brown rice, vegetables, quinoa, stew or etc...base it off by your own assumptions. Since it is from japan, I believe this would mostly work for white rice more. Note: It will be really messy when you cook this in your microwave but cleanup is easy as all you need to do is wipe off.\n","id":"d07877e1-da97-4169-bcbf-9bf11cf51534"},{"text":"\n  Works great, when instructions are followed. I can understand frustrations of not having directions, so here they are below.Measuring cup - fractions are for rice, and the bigger numbers are in mL for measuring water.1/2 of the measuring cup full of rice - 120mL of water microwave for 3.5-4 min (for a 1000 watt microwave)1 full cup - 220mL, 4.5-5 min1.5 cups - 320mL, 5.5 min2 full cups - 420mL, 6.5 minOriginal directions are for 500W microwaves, I don't think they are too common in the US. Times above are adjust for 1000W. Generally wash the rice until water runs clearer, before adding appropriate amount of water. Let the rice soak for 15-30 minutes before cooking.\n","id":"d9289308-09f8-46a8-adc8-0015f7ae8619"},{"text":"\n  Fortunately, rice is not too hard to cook. The lack of instructions is not a big problem. Everyone likes their rice cooked differently. I used 1 cup rice with 1 2/3 cup water and cooked it on high in the microwave for about 12 minutes. Let the rice sit for about 5-10 minutes and have some darned good rice. You will need to play with the water and cooking time to get the rice to come out the way you want it. I added a little butter after cooking, ummm good. This rice cooker appears to be of a good quality hard plastic, the price is right but the lack of English instructions made me subtract one star.\n","id":"bbec7c08-cd2e-4db5-8e1a-76d415a4f221"},{"text":"\n  I actually needed to cook small amounts of white rice for my dog who temporarily lost her appetite. I thought an electric steam rice cooker was overkill for cooking such a small amount. This microwave rice cooker was perfect for my situation. My dog's appetite is back to normal, and now I use it for myself when I want a little bit of rice. The only down side is water seems to boil over, but I have a microwave that has a glass plate on the bottom, so it's not that big of a deal to wipe up after I cook my rice. It's a big plus for me to only have to deal with such a small container for cleanup and storage.My recommendation for perfectly cooked rice (on the soft side), 2-4 servings:Add 1C uncooked rice to containerRinse and drain with inner basket attached until water is clearAdd additional 2C waterLet sit for about 30 minutes to plump up uncooked riceMicrowave on high for 10 minutes (with lid attached securely)Let sit for about 15-30 minutesI then gently stir rice with spatula to fluff up rice.BTW, cooked rice stays very warm in the cooker for a long time.\n","id":"488dc44f-b91f-4fb9-bd25-49de1a4d7bd2"},{"text":"\n  This is a great rice cooker; it actually cooks rice better than my electric rice cooker.I love how it comes with a rice paddle and measuring cup!It is very easy to clean, basically wipe a soapy sponge over it and rinse.(I have not tried it in the dishwasher but my guess would be that it is top rack safe)The only minor problem I have had was one of the clamps on the side falling off, but it wasn't hard to put back on.Bear in mind: The instructions are in Japanese so that may be a problem for some.\n","id":"50d2b3b2-59d5-4c45-8420-9a8cadc89bed"},{"text":"\n  These work great. Clean the shower floor perfectly.\n","id":"b3f19796-968b-4e6b-9e65-f747f55a4fc7"},{"text":"\n  it works great\n","id":"41299dc7-b080-4831-ab95-99f8b6b3f815"},{"text":"\n  I like this product and i use this to clean my kitchen sink.  this get the little scuff marks out very easy.  I would purchase again in the future if i was ever in the market again for this product and would also recommend this to others looking for a similar item.\n","id":"d403bda0-bf5a-4368-bd28-98f3b2858516"},{"text":"\n  perfect\n","id":"eaa3c1ef-a7cc-4270-aa2b-18256182a58f"},{"text":"\n  Really does a great job on my bathtub. never looked so clean !!! Thanks !!\n","id":"b7899cd1-4c95-4f47-8cff-7aebe6a85b04"},{"text":"\n  I'm a Thai who grew up in Thailand and now live in the US. I have been cooking some simple Thai dishes at home. Now that I'm pregnant and have morning sickness I have no energy to cook. I asked my husband (American) to cook some Thai foods following the instructions in this book. He hasn't cooked any Thai foods before but he has tasted several exotic Thai dishes. I'm very impressed with the results as he carefully follows the recipes and instructions in this cookbook. He said the instructions are very clear and the cooking is fairly simple.I looked at a few other Thai cookbooks and found this book contained the most day-to-day homemade meals that I grew up with. The cooking style is homemade and authentic Thai. The dishes once done may look different than what you will see from Thai restaurants in the US.For example, Pad Thai, I grew up seeing how it was made on a daily basis. Pad Thai in Thailand will have a light (clear) color which I prefer while Pad Thai at most Thai restaurants in the US will have red or dark brown color which I believe the sauces have been modified.Needless to say my husband and I are very happy with this cookbook. If you'd like to try the homemade versions of Thai foods, I highly recommend this book.\n","id":"81ed05b1-c087-414f-9aa2-a353889a180c"},{"text":"\n  UPDATE: If you live in the US and want to recreate food you ate in Thailand, this is the book. I lived there and my husband is from there. I've had this book for a year now and consider Leela to be the number one expert in making Thai food. Here are the recipes my husband and I have tried and can recommend:Paste for Sour Curry - game changer for us, we eat sour curry now several times a month with different ingredientsCurried Fish Custard - OMGSticky Rice using splatter screen method - best method hands down!Curry Noodles with Chicken - I didn't even know my life was missing this soupRice Noodles with Chicken and Chinese Broccoli (pat si ew)Spicy Basil ChickenRice Congee - the first good JOK on this side of the oceanShrimp Paste RiceHot and Sour Prawn Soup - finally a good Tom Yam Kung recipe!Northeastern Minced Chicken SaladStir Fried Glass NoodlesCrispy Wings with Three Flavor SauceSpicy Grilled Beef Salad - one of my husband's top requested dishesGlass Noodle SaladGreen Papaya Salad - thank you Leela, finally good somtam!Coconut Galangal Chicken Soup - again, replaced my old recipeFish CakesDuck Red Curry with Pineapple and TomatoesSweet Dry Curry of Pork and Long Beans - I had tried for years to make a decent Pat Prik Khing, finally found this!Stir Fried Chicken with Chile Jam - was always looking for a good recipe for thisClear Soup with Silken Tofu and Chicken Dumplings - makes me feel like I am back in Thailand!!Thank you Leela, you have really improved our cooking and eating!\n","id":"22153e5e-a73c-4df0-87ae-16db64684e1e"},{"text":"\n  This book allowed me to make the leap into authentic Thai cuisine. Every recipe I've tried is stellar. This book will allow you to make as good, or even better restaurant quality Thai food. I personally was not satisfied with the quality of Thai restaurants in my metro area which is why I wanted to make my own.The most difficult part is finding all the ingredients you need. The author is very strict on the ingredients needed which will assure that the recipes come out well. If you do not have a well stocked Asian store nearby, you will be hard pressed to gather what you need, although I have not tried online sources as I was able to find all but Kaffir limes locally (I bought dried Kaffir peel on Amazon, though there is an online source that sells the whole fresh limes which I will be trying soon).Many of the key ingredients have no substitute so it is essential to use only what is listed. Once you have the right elements, the recipes are relatively quick to make. The only problem I have is the recipes in the book seem to be suited for no more than two people. I have found I needed to double most of the ingredients to offer an adequate meal for myself and two young adult sons, which usually offers us leftovers the next day.\n","id":"c7893ea9-039c-4d7e-ae89-5bacae6fd8ea"},{"text":"\n  This book is almost entirely composed of meat recipes and a few fish recipes.  I eat meat rarely, and I had no idea that this book had almost no vegetarian recipes.  When I go to Thai restaurants, I order a lot of vegetarian dishes, so I didn't expect this.  The best thing about this book is the curry recipes.  But as much as this author may be the authority on Thai cuisine, I just can't really use this cookbook.\n","id":"5b4b138e-4af2-4af8-964b-2365db88a58c"},{"text":"\n  I have been cooking from this book for the last three weeks, have made about 10 dishes so far.  We tried one recipe that was just ok, everything else has been delicious. When you consider my husband and I spent $30 on our last Thai dinner in a restaurant for food that was not as good as we can now cook at home, this book is a real deal.  We live in a rural area without Asian markets, but with a few things ordered online and some substitutions these are recipes are perfectly do-able by a cook of average skill like me.\n","id":"6c84cfd8-a842-4e85-a0bc-512474a346fc"},{"text":"\n  Suzy Susson’s “The Complete Instant Pot Cookbook” is extremely helpful. The dishes she describes are delicious. Her book contains 100 recipes that are easy and quick to cook in a pot. And her helpful book includes a beginner’s guide.She tells us about such tasty dishes as Italian Style Potatoes, Rice Recipes, Mushroom Oatmeal. Asian Butter Chicken, Easy Chicken Salad, Chicken Liver Breakfast, Special Beef Roast, Mixed Mushroom Pate, and many more, including many deserts.She tells us how to use a pot, how to set the timer for various dishes, how to slow cook, keep warm, and more. She defines various measurements for us such as 12 teaspoons equals ¾ cup. She gives us ingredients for each dish, total time necessary to cook it, serving size, detailed easy to read instructions, and the nutrition, such as calories and fat.It is easy to use her book to navigate from one item to another by simply touching the item.In short, Suzy Susson makes it easy for us to enjoy good foods.\n","id":"fd145314-8f80-4c76-8cbf-772703e448ec"},{"text":"\n  Author Suzy Susson’s passion is cooking and she happens to love writing about her recipes. Her books focus on healthy eating and weight loss while enjoying delicious recipes made simple with the Instant Pot.Suzy explains in her Introduction the concept behind this particular book – ‘There are things to consider when it comes to making use of an instant pot. Such considerations include its operational know how and the appropriate way to use it. The instant pot is a little but powerful equipment in the kitchen. It is a combination of functions in one. In the instant pot, you have yourself a yogurt maker, slow cooker, and rice cooker. The instant pot works with pressure manipulation and this is why you are able to get boiling water at a different boiling point without altitude change. The steam generated at this changed boiling point is sealed in and this raises the boiling point. This was initially designed for hikers who need to cook on mountain peaks but has found great use in the kitchen of your home due to the advantages it offers which include time efficiency and enhanced flavor. There are so many advantages the instant pot has over other pressure cookers which include a stainless inner cooking pot and other features such as a handled trivet which lay to rest your worry about handling hot pots.’ She proceeds to instruct us about the various buttons on the pot and which ones to select for various food types and how to manipulate them for success.Then come the recipes – each with time required to make the recipe, the servings, ingredients, excellent instructions, and finally the nutrition values of that dish (calories, fat, carbs, fiber, protein).  She begins her tasty assortment with Breakfast dishes (lots of surprises here!), Rice recipes, side dishes, poultry recipes, and desserts, each section with an opening color photograph to stimulate interest – over 100 very health and very tasty and easy to make dishes with the aid of the Instant Pot and Suzy Susson’s creative culinary art.This is a strong book and one that applauds health as well as ease of preparation and exceptional taste! Grady Harp, June 18\n","id":"29307d85-60fc-4b64-b8ea-2e432b31513a"},{"text":"\n  My husband is the cook in our family so we went through 'The Complete Instant Pot Cookbook ~ Over 100+ Quick & Foolproof Recipes for Your Whole Family with Beginners Guide' together. We do not own an Instant Pot but we do often use our pressure cooker. My husband is now thinking about investing in an Instant Pot.We picked out about ten recipes to try based on our taste, food allergies and ones we could easily adapt to our handy pressure cooker. The ten we tried all came out being wonderful new ideas for meals in our kitchen. We are also going to try the jam recipes when fresh fruit is in season next summer. This was a great recipe book for us to renew our interest in using pressure to cook food. The directions were clear and easy to follow. My favorite was Creamed Chicken.\n","id":"126dcd40-645b-4845-9c7c-788f32307304"},{"text":"\n  I loved the recipes in this imaginative cookbook.  I had gotten an installing but was unsure of how to make traditional dishes in it.  These recipes are fast, easy, and foolproof.  Literally it's load, set, forget! Or set, set the table, and look, dinner's already done!!\n","id":"a89c4f50-63ca-4191-9910-a2a7108cf590"},{"text":"\n  There's also a reason why recipes aren't listed.  Glad,  so so glad I only spent a dollar.  Run if you think this will help you to learn the practical uses of your instant pot!\n","id":"b1bc3f90-92a8-4b50-93a0-eef7c5b5937a"},{"text":"\n  like it\n","id":"d8c2bddd-4aa2-4efe-91fd-2a465643b34f"},{"text":"\n  Summary of reasons to like this pot:1. Regardless of its being a pressure cooker, the pot itself is high quality;2. It is easy to clean;3. It is easy to use;4. It can make cooking go faster; and5. It forces flavor into meats and beans better.1. I was surprised by the quality of the actual pot itself.  I cook real food almost every day and have a nice pot set.  The aluminum sandwich bottom for this pot is better than any I've tried before.  When you're browning meats to enhance flavor and taking them off to brown onions and garlic, it is not uncommon to have scorched spots in the bottom of your pan because of where the flame hits it.  The heating on this pan is so even, that the browning effect (where so much flavor is!) is even as well.2. Because the browning is even, it's easier to clean, plus there are not too many parts to remove and clean.3. Although it works a little differently than some pressure cookers, bringing items up to temperature first and then putting the lid on is easy.  Wait for the first or second red line to appear (as directed in the accompanying cook book), and turn down the flame to very low.  You'll get the hang of it quickly.4. Cooking real food takes time.  Chopping onions, vegetables, meat, etc. is a chore and there's way around this fact.  Browning in the pan adds flavor, but also prep. time.  Where a good pressure cooker can help you is to reduce the time needed to simmer and enhance flavors.  Because so little steam escapes from this unit, all the flavors are forced together and intensified.  Example:  I have a bean recipe I got from a friend I've made regularly since 1998.  It's simple, flavorful, has few ingredients, and everyone loves it.  I make extra so that I can render the fat out of chorizo to make refried beans, which my kids love even more.  If you did not soak the beans the night before, you have to boil them hard for 1 hour, pour the water out, rinse the beans, put them back in, add the other ingredients, and wait 1-1/2 to 2 hours.  If you want beans tonight, you need to know in advance and start early.  BUT, with this pan you can \"pre-soak\" in 10 minutes time and have the beans ready, from start to finish, in under 1/2 an hour.  Stews, soups, broths all go ridiculously quickly and easily.  Even when preparing ingredients to add to a casserole, using this pot makes the entire process shorter.5.  I'll admit, I really don't understand why, but somehow using this pot intensifies flavors.  The first time I made the bean recipe I referenced above, both of my kids (14 & 16) like them better--and so did I.  Same ingredients, same amount of water (I could have used a lot less), better result.  That's been the case for just about every trusted recipe I've cooked in this thing.  But in less time.Yep.  This item's a little spendy.  It's worth it.\n","id":"88767692-7f20-4722-b686-0047aa009ee0"},{"text":"\n  A food goon friend of mine sold me on buying this \"overpriced\" pressure cooker by pointing out that it can be used as an autoclave.I have yet to autoclave anything in it, but it's still working excellently for food.The curry beans that I cooked last night went swimmingly -- twenty minutes at full temp, and then left to cool down normally.The cooker feels nice to use, and it looks elegant on the stovetop.  The included recipe book was a nice touch, as was the parts catalogue for when I'll need to replace the rubber gasket someday.\n","id":"16fd1a99-d61e-42a0-b5fb-06e9177db72f"},{"text":"\n  I am a 50 year old male and I do most of the cooking in our home.  I have been researching pressure cookers for over a year and decided to buy the Kuhn Rikon because of the rave reviews and Swiss quality.  This cookware does not disappoint; very well made and extremely quiet!  My first meal was the basic 101 beef stew;  20 minutes and it was delicious;  it was better the second day on re-heat though.  Second meal; 20 minutes; good ole fashion pinto pre-soaked beans & ham; again very good.  Third use; 2 cups of Jasmine rice; 4 minutes and presto; done to perfection!This device is very simple to use and easy to clean; it's safe and cosmetically appealing.  It cooks very fast to say the least and the food taste as good as cooking something for 14 days in a slow cooker!  Needless to say I'm very impressed and excited and that is saying a lot because at 50 years old I don't get excited in the kitchen anymore that is of course unless Giada De Laurentiis was to show up and help me cook a meal...!!!  I can't wait to try it out on more recipes.  I just wish I would have discovered this thing 30 years ago!  Don't waste your money on cheap wana be pressure cooker imitation devices; make a wise investment and buy the good stuff; Kuhn Rikon; you won't be sorry!  My next soon to be meal; pulled pork; Carolina style ... yum!\n","id":"f9111305-3f54-47ef-b80f-af9b7812cf68"},{"text":"\n  After using other stainless steel pressure cookers over the past thirty-plus years, we decided to update our older 6-quart model for this one.  We are extremely happy with this purchase so far.  We've made vegetarian chili (using TVP instead of meat), Pan-in-pot method brown rice, pulled pork (from an 8+ pound shoulder roast) all with great success.  The puled pork was extremely tender and surprisingly delicious.  We also made one of the recipes from the included cookbook (Italian Chicken) and were delighted with the results.Most impressive is how quickly this cooker comes up to pressure and how quickly pressure releases using the natural release method.  One thing we needed to re-learn:  determining when to turn the heat down as the cooker gets to cooking pressure.  The older cooker makes a racket with the jiggler rocking and steam hissing. This one is very quiet and needs to be watched as it comes up to pressure so that it doesn't go beyond its proper cooking pressure.  We really appreciate how quickly this cooker responds to the flame adjustments on the stove.  Overall, we are impressed and sorry we waited so long to make this investment.  Like most good things in life, you get what you pay for...this is expensive and worth it!\n","id":"bd222042-2790-47cc-af0b-219a61b5fc3b"},{"text":"\n  Works get- when the housing unit is. It broken! I’m going on my 3rd replacement in 2 years. Probably because it’s plastic, it doesn’t last. It’s a pain and too bad because I really would love to give this pressure cooker 5 stars!\n","id":"3a44d0e9-5b9a-4d87-90ed-4a6ac565014b"},{"text":"\n  The cooler is really good quality, but the ice pack does not stay cold for very long. We purchased two: One to transport bottles to daycare, so we don't need to ice pack since the bottles go in the fridge once we are there. We are able to fit six 4-ounce Avent glass bottles in it without the icepack, though we usually only bring 4-5. One to bring to work to hold the bottles as a pump, which I wish that the ice pack worked better because I do not have easy access to a fridge. I can fit six 5-ounce (maybe 6-ounce, not sure) Mendela storage bottles with the ice pack. Overall I am happy with the purchase.\n","id":"16eb738e-5335-4c3e-aa49-75e7a242b54b"},{"text":"\n  Pros: Love the size and shape of the bag holds 6 5oz medela bottles perfectly with the contoured ice pack. Cons: the silver thermal lining ripped around the stitching, almost like the seam cause a perfect perforation line the ripped away after minimal usage of only 2 weeks.\n","id":"5b718d05-2149-456d-a694-90324f169060"},{"text":"\n  Great cooler - but it doesn’t fit in my Momcozy pumping bag.  I really wish it did!  It’s also fairly short so it definitely wouldn’t fit tall 8/9oz. bottles.  It would be a great cooler to hold six 5oz. pumping bottles though!  I really wish it had fit in my bag.\n","id":"4e7989f9-5477-494b-a75a-2663938a1d09"},{"text":"\n  It works pretty well for storing pu.ped breastmilk throughout the day.  I prefer to have a second thin ice pack in the bottom of the cooler to ensure the milk gets cold and stays cold.  It doesn't get refrigerator cold during 10 hours (I pump on my way to work and don't put it in the fridge until I get home), but it does get colder than room temperature.\n","id":"3097d271-f0a6-4887-b1d8-84e2d765050d"},{"text":"\n  I use this cooler because I pump at work and do not want to store my milk in the employee refrigerator. I leave the ice pack in the freezer over night and take it out at 6 am and go to work. I get off work at 230 pm and the ice pack and my milk are still cold at the end of my shift. This is a great, high quality product. Perfect for pumping working mothers.\n","id":"87a9cb5a-a691-47ae-857b-36213f5d53a2"},{"text":"\n  Oh, I adore this book. There are fantastic colorful photos throughout of not only the finished product, but tons of process photos. His instructions are crystal clear. The recipes are easy. Many require you to make your own stock, but it’s Dashi, and that only adds about 15 minutes to a recipe. There are little blurb boxes peppered throughout, called Japanese Grandmother Wisdom that are informative and charming.He has an ingredient glossary at the back, but no photos of ingredients. That’s the only bummer. If there are ingredients in a recipe that you’re unfamiliar with, it might be helpful to Google it before running to the store so that you know what you’re looking for.Pictured below:1) Ingredients for California Temaki2) California Temaki. It’s hand rolled sushi. I’ve made sushi before, but not Temaki, its much easier, casual, rustic cousin. Delicious and so visually interesting and beautiful. Easy peasy. He mentions that you could put out the ingredients and let people pull together their own Temaki at a party. I could see that.3) Gyoza (Pork and Cabbage Dumplings – Potstickers!!!) and Yasai Itame (Stir-Fried Vegetables). Amazing! These were the best potstickers we'd ever had!4) Yasai Tempura (Vegetable Tempura), and Shrimp Tempura. Wonderful! Mess warning! ;)5) Supagetti No Teriyaki (Chicken Teriyaki Spaghetti). Fantastic! You'll never buy teriyaki sauce again! If you put the water on to boil for the pasta, then get the chicken going, then get the teriyaki going, you'll be eating in 30 minutes. Great for a schedule pressed night.Some other things I have flagged to try are Spicy Tuna Temaki, Suteki Don (Steak Rice Bowls with Spicy Teriyaki Sauce), Tamago Supu (Japanese Egg Drop Soup), Dango Jiru (Japanese-Style Chicken and Dumpling Soup), Tsukune No Teriyaki (Chicken Meatballs with Teriyaki Sauce), Nasu No Misoyaki (Eggplant with Chicken and Miso Sauce), Tori No Teriyaki (Chicken Teriyaki), and Shumai (Japanese-Style Shrimp Dumplings).\n","id":"069d20fc-8617-4819-961d-5d07f75347bf"},{"text":"\n  The recipes are ok, nothing too special, as the title suggests they should be. But about 25% of the book constantly belittles western food and how Japanese versions are superior or Japanese people have been doing certain things better than the rest of the world for hundreds of years, etc. It really makes the book a nuisance. At one point for example, the Japanese author talks about how he has tasted enough fried chicken to know that Japanese know how to make the best fried chicken in the world. Or how Japanese  have known for years how to make soup base superior to French soup base for a fraction of the time. Ok really? It’s fine to have pride in one’s heritage but this author keeps getting on my nerves by constantly belittling other cuisines\n","id":"6c3f9ca6-64bc-44fa-8ee8-8647b2e94c10"},{"text":"\n  This is a decent, but not amazing Japanese cookbook. As an avid fan of Japanese cooking, I own 10+ cookbooks and being a fan of Morimoto, this one was a little disappointing. While the recipes are OK, they tend towards the Americanized versions of the dishes with a flavor balance towards the very salty and very sweet flavors - consider reducing sugar and soy from written recipes and add more later if needed. Too many Japanese cookbooks teach Teriyaki sauce and Miso Soup, and I was hoping for Morimoto's to teach more more modern home dishes such as Yakiniku and Shabu Shabu sauces. Additionally, even though the recipes are geared towards home cooks, they still on average tend to require at least 5-10 ingredients and 1 hour or more. If you're looking for simple yet very delicious Japanese home cooking, I recommend starting with Japanese Home Cooking by Yoshihiro Murata, also found on Amazon. The recipes look deceptively simple but they are the best versions around! The reason I still give this cookbook 4 stars is that I've learned a few good tips and tricks from the book and there are some advanced recipes which I will try soon and update the review. My recommendation is to rent this from the library first before buying.\n","id":"be8cbdb0-10e7-4ac1-a099-6b83fc87ae84"},{"text":"\n  One of my favorite cookbooks is Jacques Pépin's Everyday Cooking. Chef Morimoto has produced a fine version for everyday Japanese fare.This is not a \"mastery\" of Japanese cooking. For that look to Japanese Cooking: A Simple Art. Morimoto has given us catsup fried rice, a dead simple dashi (look folks, simple rarely is), a lovely set of pickles, and a sublime savory custard.A delightful addition to any kitchen. Nobody interested in lovely and simple will go wrong with the Miso & clam soup.\n","id":"747f3040-bdf1-46f9-9d2a-f8fa663d2536"},{"text":"\n  Terrific book.  I have been studying japanese home cooking for a few years (through Harumi Kurihama and Elizabeth's Andoh's books), so I was thrilled to see Morimoto come out with a home cooking book.  It's really fun to see and hear him in a casual environment.  All the recipes so far have been delicious.  We have made the handroll sushi night into a regular dinner feature -- it's like the Japanese version of Taco Night!\n","id":"337ac271-91c8-4ba2-b589-3600c8be3490"},{"text":"\n  Nice unit. Pot was a bit small for steaming at 1.0L spec. Subsequently ordered a 3.0L Xiaomi thru Lazada but it turned out to be Chinese knockoff with same sized pot and Lazada refused refund or exchange for larger pot ? (if it exists !!). No customer care !!\n","id":"8dca5e83-2b46-4720-8c68-1bf2222bbbcb"},{"text":"\n  Overall good container for 5kg of rice. There is a little “trick” in locking one side of it to make it airtight (at least the one I got). So, if you’re left wondering why one side seems loose when you close it, don’t give up quickly. Try gently hooking your fingers somewhat on the underside (of that loose side) while closing it. I know mine worked when I did that.\n","id":"42366b40-c56d-4cf1-93ba-85b4a213fc4c"},{"text":"\n  fast delivery. good quality.I usually buy rice with 5KG package and this rice stocker is just the right size.can cover tightly so can put the rice in the kitchen without worrying.\n","id":"88ed6d77-d520-4cc4-80fa-6b3aa30c4d64"},{"text":"\n  This product is superb. I had a longstanding issue of rice weavils for close to a year. But upon the arrival of these containers, everything is good now! So damn relieved 🙆🏻‍♀️\n","id":"fde4e74c-8265-44fd-9e1c-2f671d64036c"},{"text":"\n  Fits 5kg nicely with littlle space left. Will need to empty it to the last cuo before topping up again.\n","id":"d4646cd7-0f23-42a3-a8bd-397045a81686"},{"text":"\n  All of the recipes are awesome and the directions and pictures make the recipes easy to follow. I’ve recommended this book to a few people already and I’ve only had it a week or so. Overall this is an excellent guide.\n","id":"947c3fc4-aef6-4c5d-bc0a-4e957cbd02f5"},{"text":"\n  This book contains lots of helpful information. It's well written and doesn't cost too much. The author will remember that a beautiful book is hidden for us. Many thanks to the author for giving us such a beautiful book.\n","id":"aa8b4af0-4c94-4869-90a9-2fb04b620e8c"},{"text":"\n  Overall, I enjoyed reading this book! This is a thorough and well on instant pot lux cookbook guide. This explains the origins of the extracts, This is really helpful hope this will help me.\n","id":"3910b5f2-9681-4489-a4c8-f4c6dd0de308"},{"text":"\n  Loved this book, it's easy to reading and great information on instant pot lux cookbook. you feel like you are doing everything right and this book. I would recommend it to anyone!\n","id":"c0d92396-24b1-40b5-bdeb-f8ae53a5f67f"},{"text":"\n  This book is amazing. I inclined such colossal amounts of viable things from this book. I love this book. I genuinely value scrutinizing this book. I would recommend this book to anybody. Whatever, on account of writer and must, suggested for this book.\n","id":"71a7b513-95a4-410b-9403-d61c54741593"},{"text":"\n  No more scrubbing! Just walk around the house with your drill and a brush and you'll be amazed at the results! No wonder they have the warranty they do. I doubt very few if any folks return one of these after seeing how much work and time they save using it. I have had no issues with \"splash back\" others report.I had purchased the \"pads\" first and they also are great. The brush seems to be more effective in my indoor/outdoor uses.Recommend this great item....just be sure your drill has power as the scrubbing does run it down, as it should.\n","id":"a4af3589-56b8-4d63-b786-690f0a81db19"},{"text":"\n  Despite its description, this brush did not clean swimming pool tiles.\n","id":"234c695e-7c2f-4500-a3d6-80e154e512f3"},{"text":"\n  Waited for a slight break in the weather and tried it on the spa.  Will save the pool for warmer weather.\n","id":"ec8126f7-eaa7-4e68-93a5-5ad4e582d7b7"},{"text":"\n  I really like that this product comes in a variety of stiffness options. I got one stiffness for cleaning pool tiles and I liked it so much I got another for general cleaning around the house and car tires.\n","id":"2464a6b6-1b9f-4fa9-8abc-e2317a274c4d"},{"text":"\n  Cool tool! Cleaned my hot tub with so much less elbow grease! Very happy I found this. Works wonders in shower, tile, grout & tub etc...\n","id":"37dbc450-e9ca-4e0f-a46d-d7c0e3e98ca0"},{"text":"\n  Only the 240V output worked - but that's because it bypasses the transformer. The 100V output gave 1.2V, and the 110V output gave about 20V!! Obviously something wrong with the transformer. I removed the fuse, and the power switch still lights up with no fuse inserted and 240V output still gives 240V, so the fuse is only for the transformer, it doesn't cover the 240V output.From other reviews of this product, it seems it's just down to luck as to whether your unit will work or not.\n","id":"d660ffc7-e9ea-4174-bec5-5966f73a36b6"},{"text":"\n  I've only used it once so far. I bought it to step down 220v and inflate an air mattress with 110V electric pump - and it did the job. I had no issues with it. It's simple to use, would recommend. Handy to have at home for future use.\n","id":"b8131b0c-413f-4c30-bab6-08a8586bc793"},{"text":"\n  This very heavy and quite bulky .But it works very well no noise and very easy and simple to use.\n","id":"2012dc51-5a8e-4236-8e03-6d740693a926"},{"text":"\n  Item was already rusty when delivered.\n","id":"1912f74a-751f-4206-928a-0497d792c62c"},{"text":"\n  Smells like something is burning\n","id":"2335b76f-c3fe-4c54-80b7-57d20a217d58"},{"text":"\n  Good\n","id":"718af077-d7ca-4708-808c-6e76a5e2ce1a"},{"text":"\n  This cooker is easy to use and can accommodate a number of cooking styles. Could not give it a 5 star rating as the design can be further improved. When opening the lid, water droplets tend to dribble to the side and can flow down along the pot onto the heating element.  The pot can take 15 to 25 minutes to build up pressure and another 10 to 15 minutes to release it. So, please add 25 to 40 minutes to your overall cooking time. Overall, still happy with the purchase as it is one handy cooker to have in the kitchen.\n","id":"075c7739-f743-480f-a496-cc1394ab7edf"},{"text":"\n  Item well received and works well. Ordered in 2019 and still working well. However there were instances where the handle locked on its own and air pressure wouldnt release. Even after turning off it didnt work. Other than that, a very multi functional item and easy to use. However i dont know how to clean out some rice that dropped under the cooker plate. So far no smoke or fire from raw rice in the machine.\n","id":"db4f98c4-4f80-410e-afb1-f949ad8c5551"},{"text":"\n   love our HD2145! my daughter loves good soup and that usually takes a few hours on the stove which is a waste of gas! now i can get almost the same results with just a fraction of the time! even better that i got it during black friday sales! woohooo!\n","id":"bdf1cb8b-bc64-40c2-85b6-9edfe5156842"},{"text":"\n  I’ve made some good pulled pork and chilli con carne in it so far. Don’t have a very good induction booklet but you can figure it out\n","id":"94eaec32-339a-46ff-923d-d62726b89335"},{"text":"\n  Should have invested in this product sooner. It's so easy and convenient to whip up a meal within an hour!\n","id":"aea5c4e0-93c3-4622-91a1-a496ba48237d"},{"text":"\n  I am usually not the kind of person who is overly critical about things so even if the product delivers 75% of what it claims to be i am usually content , but in this after just using the product for less than 4months the aluminium of the cooker has started to fall off which makes me  nervous since i am not even sure how many times this aluminium would have gone it my system along with the food unnoticed , please don't play with people health like this ..\n","id":"9d59ecbf-d1b4-4a38-8346-82ee625e5fa5"},{"text":"\n  Prestige is well known brand in India but over the years the quality has gone down.\n","id":"0ec99531-b9fa-4bd6-a13d-3e253d4100a3"},{"text":"\n  Fast Del , I love that cooker.\n","id":"cbc0088d-d30e-4105-9069-659e33e76f78"},{"text":"\n  Very bad experience of this brand. I have this brand one 10 year old which works still but this one in just one use got marked and discoloration inside and I have trusted this brand even though bad reviews and bad pics after use. I am really sad and upset as it's too late for me to return as missed dead line. Please do not buy at all I got 12 qt..bigger size of it. I never had any bad product like this on amazon. Please save your money and use on buying other cooker but not this one. I wish I have  believed to other reviews and even though I have seen bad pics I bought it. My bad but I am hoping no one buys this after my review and doesn't do mistake like me\n","id":"ef573567-1358-4a10-b91a-510da2729f65"},{"text":"\n  Looks like prestige is not  making great products as it used to. I am really disappointed with the quality of product. On first use heard a loud noise and gasket gave up. Can't believe how could this happen. Not just the Gasket build is so flimsy that it shakes/vibrates a lot when in use. I have stopped using it  as i don't think it is safe to use anymore.I suggest buyers to look else where and don't waste your money on this product.\n","id":"17e99aa2-739e-481b-82f8-eacf70054b25"},{"text":"\n   Before returning my item I thought I’m get it another try trying to close the cooker. It just won’t close. Posting pictures below. I had to discard half a kg pulao. It’s not that I don’t know how to use a pressure cooker. I have been using prestige cookers for the past 15 years was very surprised with the quality of this.\n","id":"0c69f3ad-ab9e-47ce-b886-f69e34cd767f"},{"text":"\n  The lower handle of the pressure cooker broke in two after only using for 3 months. Tried reaching the warranty provider given in the description but turns out it is for \"Royal Prestige\" and not for \"Prestige\". Then looked into user manual to get some contact info and turns out the manual is scanned from UK's user manual. So there is no way to get in touch with the manufacturer to either repair the product or replace them.Would like Amazon to provide the correct details as it was procured and shipped by Amazon or replace or refund.\n","id":"13da7d66-1ef3-4cd7-a786-c27f0354fc02"},{"text":"\n  Thank you Amazon and I will recommend for those who is looking forward to buy the best quality pressure cooker. The cooker looks exactly as the picture shown. Even in quantity wise, 10 people or just for 2 servings capacity also it holds. To avoid scartches make sure to cook with wooden spoons and mild abbresives.\n","id":"2adee347-7a8a-47f1-9171-41bee98190c2"},{"text":"\n  I had become very irritated with a brand name battery powered scrubber I had that wasn't keeping a useful charge, even with a fairly new battery, and was looking for a robust alternative.  I found these brushes, which I can use with my high quality battery drill, and not worry about the battery running low part way through cleaning the bathroom.  The quality of the Drillbrush products is very good, and I look forward to using them for years.\n","id":"cdeae002-f54d-4bf4-a17c-a3638c6f5ecf"},{"text":"\n  This really worked.  We had a big job to do on a neglected tub and shower.  This saved the shoulders and arms from getting tired.  It seemed to hold up really well.  We will use this again in the future.\n","id":"5efc803d-f370-48cb-b4d6-c0950a738db6"},{"text":"\n  I have a tile shower a am on well water and these brushes are a GAME CHANGER! The mineral build up and mold in the corners was so hard to get at. Click these little bad boys into my impact drill and pour on a little CLR and what a difference! Made quick work of it.\n","id":"9d1ce513-6d33-4b88-92f7-7807d73b1980"},{"text":"\n  This works great for scrubbing showers (the whole reason i bought it). I feel like it scrubs harder than i can do by hand and with some shower cleaner it removes the nasty soap scum!\n","id":"3fdd80ad-9ae6-4711-b70b-38204559a417"},{"text":"\n  Excelente\n","id":"60285bce-988a-4f53-96b1-32285bc1d355"},{"text":"\n  Not much to this... Disappointing...\n","id":"14d6febd-0e62-4514-b952-30ac889394b1"},{"text":"\n   The cooker material was good, but the lid was having issues. Was not closing properly and it meant leaking from all sides. Had to return it as was bought couple of days back only\n","id":"e96a9fb7-dc5f-4228-a78d-5313b64e7f5e"},{"text":"\n  Solidly built, easy to operate. Perfect for modest sized meals.\n","id":"1f854da8-b032-46cd-9d69-2b209a04bb2a"},{"text":"\n  Update: Vinod 2L Stainless Steel Pressure Cooker also leaches metals to a small extent into the food cooked in it even though the food may not have metallic aftertaste; if one cooks every meal in Vinod 2L Stainless Steel Pressure Cooker and eats that food, soon the metal particles leached into the food buildup in the body and then one can sense their effect on the body such as the feeling of roughness in the mouth and throat after eating the food cooked in the pressure cooker; the symptoms resolve on their own after stopping eating food cooked in the pressure cooker. I think it is better to alternate among different types of cookware instead of cooking each meal in Vinod 2L Stainless Steel Pressure Cooker; however, I eventually decided to return this pressure cooker to amazon.com - with the reason for return \"No Longer Needed\" and with the explanation \"I used it several times for cooking food; its stainless-steel is definitely superior to that of Hawkins pressure cooker; however, it leaches metals into food to a small extent which build-up in body\" - and I paid $9.75 to amazon.com for its return shipping. This return was very difficult for me to submit and I am not changing the rating of this pressure cooker from my earlier rating of 4 stars; however, I am returning this pressure cooker with love and with the hope that the cookware companies may do more research and develop cookware such that if at all the cookware leaches anything into the food, it only supplements the food cooked in it and makes the food more nutritious. Food that nourishes the body and does not overload the body with heavy metals or toxins, is more important than how fast the cookware heats and whether it takes 20 minutes to cook food or 1 hour to cook food. Cookware that may take longer to prepare food but does not leach heavy metals or toxins into the food, may in fact promote heath and prolong the lifespans of the people and thereby compensate for the extra time spent on preparing food.Blessings to all.Bye.--------------------Based upon the taste of the food cooked in Vinod V-2L Stainless Steel Pressure Cooker, I think that the quality of stainless steel (Salem Steel) used to make this pressure cooker is SUPERIOR than the quality of stainless steel used to make two other pressure cookers (Hawkins and Prestige) that I purchased last month before I purchased this Vinod V-2L Stainless Steel Pressure Cooker. The food cooked in Hawkins and Prestige pressure cookers had stronger metallic \"aftertaste\" than the food cooked in Vinod V-2L Stainless Steel Pressure Cooker. Of the three pressure cookers I purchased (Hawkins, Prestige, Vinod) over the duration of about a month, the food cooked in Hawkins 3L Induction Compatible 18/8 Stainless Steel Pressure Cooker had the \"strongest\" metallic \"aftertaste\" and its harsh effect on the body was cumulative because after eating food cooked in that pressure cooker for about 3-4 days I had got blisters in the mouth and inflammation in the throat - the symptoms resolved on their own when I stopped eating food cooked in that pressure cooker; I returned that Hawkins pressure cooker back to Hawkins Cookers Ltd. so that they can test its composition and then correct their manufacturing process and improve the quality of their product; however, based on my experience, I can say that its 18/8 stainless steel was not of food grade quality. I must also mention that I had used the Hawkins Pressure Cooker to cook food on an electric hot plate stove and not on an induction stove.I like the finish on the inside surface of the Vinod V-2L Stainless Steel Pressure Cooker because the food does not easily stick to it while cooking food; and, if some food does get stuck on the cooker, it washes off easily. I have given it 4 stars instead of 5 stars because I think that the quality of the workmanship of this pressure cooker needs to be improved or the thickness of its stainless steel needs to be increased - because some of the rivets on each of its two handles can be seen and felt on the inside surface of the cooker and they get stained while cooking food (see attached photo).BASED ON MY OWN PERSONAL EXPERIENCE WITH PREPARING FOOD IN DIFFERENT STAINLESS-STEEL COOKWARE (VINOD, PRESTIGE, HAWKINS, LENOX, CUISINART, BARAZZONI, ROSLE), I THINK THAT THE OVERALL FOOD GRADE QUALITY OF STAINLESS-STEEL COOKWARE HAS DETERIORATED DUE TO MAKING THEM INDUCTION COMPATIBLE; BECAUSE, EITHER THE FOOD COOKED IN THESE INDUCTION COMPATIBLE STAINLESS-STEEL COOKWARE HAS METALLIC AFTERTASTE, OR THE FOOD COOKED IN THESE NEW 18/8 STAINLESS STEEL PRESSURE COOKERS FEELS HARSH (TO A VARYING DEGREE) TO THE SOFT TISSUE IN THE MOUTH; I THINK THAT THE COOKWARE COMPANIES MAY HAVE CHANGED THE PROPORTION OF IRON AND CARBON IN THE STAINLESS STEEL TO MAKE THEIR COOKWARE INDUCTION COMPATIBLE AND THAT MAY HAVE REDUCED THE FOOD-GRADE QUALITY OF THEIR COOKWARE. ALTHOUGH I HAVE NOT COOKED FOOD ON AN INDUCTION STOVE TOP, HOWEVER, BASED ON MY KNOWLEDGE AND UNDERSTANDING, IT IS MY OWN THINKING THAT THE OVERALL HEALTH-GIVING QUALITY OF THE FOOD COOKED ON AN INDUCTION STOVE IS LESS THAN THAT OF THE FOOD COOKED ON HEAT-BASED COOKTOP. IT IS NOT ONLY IMPORTANT WHAT FOOD PEOPLE EAT, BUT IT IS ALSO IMPORTANT HOW THE FOOD IS PREPARED. SHOULD THE FOOD BE COOKED GENTLY OR BY AGITATION? IF FERRITIC STAINLESS-STEEL COOKWARE CAN GET AGITATED BY AN INDUCTION STOVE, CAN THE BEANS, GRAINS AND VEGETABLES THAT CONTAIN IRON NOT GET AGITATED BY AN INDUCTION STOVE? I THINK THAT THE COOKWARE COMPANIES ARE COPYING EACH OTHER IN COMPETITION IN MAKING INDUCTION COMPATIBLE COOKWARE WITHOUT EVEN UNDERSTANDING HOW SUCH COOKWARE OR THE FOOD COOKED USING INDUCTION STOVES MAY BE HARMING THE HEALTH OF THE PEOPLE.\n","id":"678d24af-9bc1-4c70-a0c2-041cae1a02fe"},{"text":"\n  This pressure cooker has a very simple sliding of the cover to line up with the pot. I have a 7 liter that I bought in a store in my country and use once per week for the past 20 years to do red beans and chick peas.  I have bought 2 other pressure pots because I prepare meals in large quantities thrice per year during Ramadan (Muslim fasting period )and needed to use 2 pots simultaneously to expedite the cooking. The other brands were ruined because of plastic and complex locking system although they were stainless steel pots.  I checked the internet for Vinod and tried to buy a pot directly but the transaction was not going through.  I just thought I’d check amazon to see if they carry Vinod and was very happy and immediately ordered one.  I have left my country to study in Egypt and needed to bring a small pressure pot for a single person.  This is perfect for my situation and works great doing my unsoaked beans in 20 minutes.  The issue of the emission of steam when the pressuring begins once per minute or so is an advantage for me as if I’m not in proximity of my clock especially in my flower garden watering my plants I can easily count 20 of those emissions and then tend to switching off the cooker.\n","id":"a06316a7-d43c-4614-a5db-0eb179ba79df"},{"text":"\n  I have prestige and hockins pressure cookers. My first time with using Vinod pressure cooker. I thought of giving this brand a chance comparing the prices. Not worth even this lower price. I made dal khichadi which had ample amount of water. After 5 mins I felt burning smell. immediately took the pressure cooker off the gas and let it cool down under water. After opening I saw there was water on the top of the khichadi but it was burnt all over the bottom. I am cooking khichadi since last 30 years and used pressure cookers all the time and this is the first time in my life it burnt.Not worth it... DO not buy...\n","id":"8aeaf752-10ab-4dc7-b563-289f4c9fc6d1"},{"text":"\n  This works well. Heats up relatively quickly (though not as fast as pure aluminum ones, I assume). It locks by twisting, and you release the pressure by lifting the weight with a fork tine. I bought the 2L because I cook for one or two, but maybe I should have gone up a size. I'm OK with leftovers, and remember you can't fill it all the way up.My one complaint is, if you don't twist it closed properly, it works, but it becomes really difficult to twist it open. The heat probably doesn't help, and you're twisting counter-clockwise.\n","id":"d2b1016d-8605-4da0-9f45-1d31673ea099"},{"text":"\n  I like it very much.  Very good quality, very easy to clean.  I had a pressure cooker but this one is heavy, cook quick and very nice to serve from.  I had a small one of 1.5L and planning to get a 2L.  Much thanks you made me love to cook.\n","id":"3baae66a-b45c-48c0-b37f-589156c4b5df"},{"text":"\n  We love basmati rice... that sweet aromatic smell and the special smooth flavor that you’ll only get from basmati rice. It is totally missing. I’m talking No aroma at all, and the rise it completely tasteless. The weird thing is that we have used the Royal brand before, and it was okay; not the best I’ve ever had, but an acceptable Basmati rice. We made a second batch, paying close attention that we didn’t make some basic error in the way we prepared it, and hey... it’s not us. This rice is just somehow missing the aroma and flavor that makes basmati rice worth the extra prep effort that we go to to prepare it.\n","id":"5943535a-71fc-4ed5-9752-7eeefb378f3e"},{"text":"\n  I had seen this brand in a magazine. I looked in many stores looking for this special  brand. Finally Amazon gave me a short journey. I love the quality taste and difference it makes in preparing special recipes. My one and only rice! Thank you Royal for quality.\n","id":"b951d6a8-5880-4161-a342-b12c40397b80"},{"text":"\n  got this rice for a recipe I saw on One Pot Wonders with MasterChef  but my family really did not like the rice to much\n","id":"faf2dd38-a416-4f4d-b892-f3a7d3bc324d"},{"text":"\n  I loved the flavor and lightness of this rice, it was easy to cook and warmed up nicely when used the next day for leftovers.  I will definitely purchase this again.\n","id":"31c4b190-7578-4270-8471-1d0f80479533"},{"text":"\n  This rice always turns out light and fluffy. It’s the only brand I use anymore\n","id":"eefbe560-c2cd-4e08-ab27-3aa56d6064fb"},{"text":"\n  This book is self-published. I have several excellent self-published cookbooks. This is not one. The problems demonstrating no one ever edited or proofed this book:1. Spelling errors2. Grammar errors that make the directions hard to follow3. Formatting and typography - none! Many paragraphs print the first sentence twice. Are these section headers? If so, I wish each section header would tell me what's in the next section.The directions for using a rice cooker:1. The first half of the book simply tells me exactly what's in the manufacturer's instructions - though with less precision, not as well written and without illustrations2. Richard Cook does not explain one of the great mysteries in life (including the manufacturer's directions). Add the rice to the cooking bowl and then the water to the measuring lines on the side of the bowl, or add the water first and then the rice?Rice cooker recipes:1. Again, not well written2. All the recipes are for cooking food to add to rice after it's cooked, not in the rice cooker\n","id":"9fb7b730-0b5e-4c6f-a470-d1a5b19a3fc4"},{"text":"\n  I'm very disappointed.  I was looking for recipes specifically to steam/cook all ingredients in the Zojirushi MICOM.  All recipes except three, started with preparing the rice alone in the rice cooker and, everything else on the stove.  Of those three, they only partially prepared some of the ingredients in the rice cooker.  The table of contents did not list recipes and there is no index.  I had downloaded the sample book, it stopped prior to the first recipe.  I've had the five and the half cup size Zojirushi MICOM for quite awhile and, was hoping for recipes steaming seafood along with rice and/or vegies and/or pasta.  No luck!\n","id":"24b643a2-ec5c-45ed-afcf-13ce19164b34"},{"text":"\n  Do not waste your money on this.  It is written by someone who has a very poor command of the English language.  I found no valuable information that wasn't already in the manual.  The directions are poorly written.  It is only 45 pages total.Examples:\"Some time you will be able to find rice that come with instructions on the package to use a rice cooker, but a great way to start if using a rice cooker is to use a ratio of one cup water to one cup rice.\"  (doesn't say what kind of rice)\"If at all possible refrain from opening the rice cooker but if you have to only do it when you really have to.  (are you serious?)\n","id":"231b3874-8c9b-4f90-ba97-ab4f2c390f44"},{"text":"\n  It’s a good book.\n","id":"e4ac0cc5-11c7-4b19-9274-f7511800a25d"},{"text":"\n  This isn't the very renowned Rice Cooker Zojirush book. It's a knock off. If my young person hadn't spilled broth on it it would go into returns. Nice front photo.\n","id":"5841d69a-ccb9-49b4-91ea-9cf57009efa2"},{"text":"\n  This is a top of the line Pressure Cooker. We have other brands but prefer this one. Our first lasted about 15 years and then handle started getting loose and after one too many burners being left on accidently, the sandwhich bottom started coming apart. Now we have a new one and it is working as well as the first. They are so sturdy and a joy to use in the kitchen!\n","id":"54c637c9-ce35-4775-8191-01199373a057"},{"text":"\n  I bought this 5 months ago and now it's brokenSo worthless materialSpecially that top small pressure bolt or what ever you call it breaks in two months and mine is broken twice by now\n","id":"97ee7e48-b6c3-4f25-911c-6d878e458e2f"},{"text":"\n  Pretty good quality\n","id":"503e4385-0f54-4cae-96e6-541a12932427"},{"text":"\n  Me encanto muy fácil de limpiar el modelo está muy bonito\n","id":"6c016a68-f159-4694-ad7f-ce51b3b441fb"},{"text":"\n  I got this cooker after a lot of research, I decided not to use aluminum cookers and shift to steel. I had read aluminum leaches strongly into bitter or sour food, and causes premature senility and Alzheimer's due to body not being used to processing aluminum.  which covered shape and size... I had seen pictures of other products of this company and I liked the design: a pleasant change from the usual Prestige cooker and the Hawkins type too.I was delighted when i got it. it worked great. I started mulling ordering another and presenting it to my sister. she uses an aluminum cooker like we used to in the past, and it is not good to use aluminum as I mentioned before ... But in around 3 months of use, the steel of the body started to crack from the top down the side. Now it looks like scrap that should not be in the kitchen, but in a yard.My sister smiles when she sees it, telling me I need to stop going overboard just based on looks and Google pics!The steel they use is obviously substandard, and I am not counting the crack in the handle at all. I think there was a reason it was cheaper than the usual brands I have used in the past.\n","id":"c6e146c2-0024-4916-8c62-d73cb460b526"},{"text":"\n  Only the 240V output worked - but that's because it bypasses the transformer. The 100V output gave 1.2V, and the 110V output gave about 20V!! Obviously something wrong with the transformer. I removed the fuse, and the power switch still lights up with no fuse inserted and 240V output still gives 240V, so the fuse is only for the transformer, it doesn't cover the 240V output.From other reviews of this product, it seems it's just down to luck as to whether your unit will work or not.\n","id":"0ca60721-8d4f-4648-b7e6-93264d2e857a"},{"text":"\n  I've only used it once so far. I bought it to step down 220v and inflate an air mattress with 110V electric pump - and it did the job. I had no issues with it. It's simple to use, would recommend. Handy to have at home for future use.\n","id":"f174c4dd-288c-4350-b4d4-979b85a4a645"},{"text":"\n  This very heavy and quite bulky .But it works very well no noise and very easy and simple to use.\n","id":"10be96ad-cf33-41cc-b187-291fc166853c"},{"text":"\n  Item was already rusty when delivered.\n","id":"192ff15f-dc1c-4f69-9796-e682fb134c2d"},{"text":"\n  Smells like something is burning\n","id":"18b71880-8ee9-4167-b86d-323e280080a4"},{"text":"\n  Good\n","id":"1c7815ef-9836-42d3-bd4e-89cd75c77500"},{"text":"\n  If you like Cajun food this is the book for you! The sauce piquant recipes and crawfish and shrimp recipes are amazing!! Cabbage rolls used to take all day to make and now I use the cabbage casserole recipe to make it easier. This is the only recipe book where I have actually made and loved 75% of the recipes. And they all use simple ingredients that I keep in stock already. Nothing fancy I have to buy!! I know it sounds weird to use a rice cooker for meals but this is like a crockpot that cooks in 45min or less. If you have a fancy rice cooker you need to use the rice setting, not slow cook. And if it says to cook for a certain time then I set my timer and stop the rice cooker after that so the shrimp are not overdone.My family likes meals with substance and not just rice. This book also has a lot of recipes with potatoes instead of rice. The fajita chicken stuffed baked potato recipe is great! And it just uses frozen French fries for the potato part. It doesn't get much easier than that!!This is the perfect book for someone who loves to crockpot but wants their meal done in 45 min or less! I wish I was paid or given some compensation for this review , but sadly not. My aunt gave it to me years ago and my friends are always asking where to buy it.\n","id":"6c7647b6-5ca5-4a67-8f48-ee664f60636e"},{"text":"\n  I wasn't sure I'd be able to get the hang of using rice cooker for anything but rice. But as soon as this book arrived I read it from cover to cover and could hardly wait to try his recipes. This book is a little gem. With a little imagination you can easily adjust ingredients to make your recipes more spicy, less spicy, beef instead of chicken, broth instead of canned tomatoes with chiles, less butter, etc. etc. This is a no brainer. To some people it might look too plain but that's fine with me. It's just a good, easy to follow, minimum preparation, delicious collection of recipes, some of which are typical of louisiana cooking....which is what the author himself did not dispute. I have never used as many recipes out of any cookbook I own..and I own a lot!!! I'm currently going through all the recipes but so far my favorites are Shrimp Jambalaya, Black Eyed Peas & Sausage Jambalaya, Tex-Mex Pasta, Chicken fried rice, and Mexican Rice. There are also soup recipes, yams, potato and cabbage recipes but haven't tried these yet. Mr Bertrand I'm anxiously waiting for your next cookbook, if there is one, but in the meantime thanks for this one!\n","id":"a2019644-faae-4e1e-a1c3-865607488765"},{"text":"\n  If you like \"Cajun Cooking\", you will like the recipes in this cookbook ... please note the recipes are developed using the \"old style\" rice cooker ... the ones I have tried in the \"new style\" (Sanyo) rice cooker did not turn out well ... less water is required when using the \"new style\" rice cooker ... I'm still working on a conversion ... the recipes I have tried using the \"old style\" rice cooker turned out great and were very good ... but the recipes are great even if you decide to cook them in a standard pot using the stove top ... RPH\n","id":"62f205b4-541c-4bef-9a90-b01e54c551dd"},{"text":"\n  My latest \"kick\" is rice cookers.  I learned you can make entire delicious meals in them, not just cook rice.  This cookbook makes rice cooking/entire meals easy.  It's mostly a Cajun cookbook but you'll find many delicious other recipes too.  I had a question, emailed the author, and he actually emailed me back with the answer!!  Recipes are for 8 to 10 cup On/Off/Warm rice cookers, not for fuzzy logic cookers.  Rice cooker recipes can be made in the fuzzy logic cookers but adjustments would have to be made.  I'm also experimenting using olive oil instead of butter and the author has been helpful with that.  I HIGHLY recommend this rice cooker cookbook for On/Off/Warm ricer cookers.\n","id":"a22fcc3d-e14c-4e74-83c9-3c3fe27afb30"},{"text":"\n  I was hoping that this book would have \"from scratch\" recipes. Instead, it uses so many canned and packaged mixes that the food becomes more of a chemical cocktail than a meal.\n","id":"5feb9b39-5249-4a13-a674-6add8e197605"},{"text":"\n  If you like Cajun food this is the book for you! The sauce piquant recipes and crawfish and shrimp recipes are amazing!! Cabbage rolls used to take all day to make and now I use the cabbage casserole recipe to make it easier. This is the only recipe book where I have actually made and loved 75% of the recipes. And they all use simple ingredients that I keep in stock already. Nothing fancy I have to buy!! I know it sounds weird to use a rice cooker for meals but this is like a crockpot that cooks in 45min or less. If you have a fancy rice cooker you need to use the rice setting, not slow cook. And if it says to cook for a certain time then I set my timer and stop the rice cooker after that so the shrimp are not overdone.My family likes meals with substance and not just rice. This book also has a lot of recipes with potatoes instead of rice. The fajita chicken stuffed baked potato recipe is great! And it just uses frozen French fries for the potato part. It doesn't get much easier than that!!This is the perfect book for someone who loves to crockpot but wants their meal done in 45 min or less! I wish I was paid or given some compensation for this review , but sadly not. My aunt gave it to me years ago and my friends are always asking where to buy it.\n","id":"edd599dd-d0fa-406f-992b-ca5d4a0cebfb"},{"text":"\n  I wasn't sure I'd be able to get the hang of using rice cooker for anything but rice. But as soon as this book arrived I read it from cover to cover and could hardly wait to try his recipes. This book is a little gem. With a little imagination you can easily adjust ingredients to make your recipes more spicy, less spicy, beef instead of chicken, broth instead of canned tomatoes with chiles, less butter, etc. etc. This is a no brainer. To some people it might look too plain but that's fine with me. It's just a good, easy to follow, minimum preparation, delicious collection of recipes, some of which are typical of louisiana cooking....which is what the author himself did not dispute. I have never used as many recipes out of any cookbook I own..and I own a lot!!! I'm currently going through all the recipes but so far my favorites are Shrimp Jambalaya, Black Eyed Peas & Sausage Jambalaya, Tex-Mex Pasta, Chicken fried rice, and Mexican Rice. There are also soup recipes, yams, potato and cabbage recipes but haven't tried these yet. Mr Bertrand I'm anxiously waiting for your next cookbook, if there is one, but in the meantime thanks for this one!\n","id":"5c1d8a4c-8465-4f7d-8a3d-98459e612306"},{"text":"\n  If you like \"Cajun Cooking\", you will like the recipes in this cookbook ... please note the recipes are developed using the \"old style\" rice cooker ... the ones I have tried in the \"new style\" (Sanyo) rice cooker did not turn out well ... less water is required when using the \"new style\" rice cooker ... I'm still working on a conversion ... the recipes I have tried using the \"old style\" rice cooker turned out great and were very good ... but the recipes are great even if you decide to cook them in a standard pot using the stove top ... RPH\n","id":"aafaf3b4-222c-4fca-bdc0-685f23b82332"},{"text":"\n  My latest \"kick\" is rice cookers.  I learned you can make entire delicious meals in them, not just cook rice.  This cookbook makes rice cooking/entire meals easy.  It's mostly a Cajun cookbook but you'll find many delicious other recipes too.  I had a question, emailed the author, and he actually emailed me back with the answer!!  Recipes are for 8 to 10 cup On/Off/Warm rice cookers, not for fuzzy logic cookers.  Rice cooker recipes can be made in the fuzzy logic cookers but adjustments would have to be made.  I'm also experimenting using olive oil instead of butter and the author has been helpful with that.  I HIGHLY recommend this rice cooker cookbook for On/Off/Warm ricer cookers.\n","id":"26744245-0ccb-432b-b742-7bc01b2f79a2"},{"text":"\n  I was hoping that this book would have \"from scratch\" recipes. Instead, it uses so many canned and packaged mixes that the food becomes more of a chemical cocktail than a meal.\n","id":"d1cc1473-884a-4415-aa79-76abda46584f"},{"text":"\n  Only the 240V output worked - but that's because it bypasses the transformer. The 100V output gave 1.2V, and the 110V output gave about 20V!! Obviously something wrong with the transformer. I removed the fuse, and the power switch still lights up with no fuse inserted and 240V output still gives 240V, so the fuse is only for the transformer, it doesn't cover the 240V output.From other reviews of this product, it seems it's just down to luck as to whether your unit will work or not.\n","id":"d1364ec2-a7ec-4c81-a83a-4edac85b4a03"},{"text":"\n  I've only used it once so far. I bought it to step down 220v and inflate an air mattress with 110V electric pump - and it did the job. I had no issues with it. It's simple to use, would recommend. Handy to have at home for future use.\n","id":"d88b91da-a734-40a3-b308-1b9f3d223d81"},{"text":"\n  This very heavy and quite bulky .But it works very well no noise and very easy and simple to use.\n","id":"10115463-c2d3-4e9c-9d13-5ced0e805f62"},{"text":"\n  Item was already rusty when delivered.\n","id":"7e13a8a6-63a3-4397-ae1a-77ff4688a9c8"},{"text":"\n  Smells like something is burning\n","id":"22b1f11d-8157-482d-8d87-874d74491fb3"},{"text":"\n  Good\n","id":"1ba843b5-1cfc-4619-a04b-03993769c671"},{"text":"\n  I attach this beast to my Dewalt cordless drill, and scrub away on the nasty algae buildup at the bottom of the horse stock tanks. It did such a great job!!! It took off all the older cemented on algae that no amount of scrubbing by hand would be able to get. It even gets into edges and corners!!This scrubber is fast, strong, and fun to use!!While I obviously didn't do any underwater scrubbing, I did have a tiny bit of water still on the sides and bottom of the trough. Tiny droplets got on my drill, but it didn't nor would it have any ill effects.  I scrub, rinse, and scrub the parts I missed.  It only took one pass with this scrubber to get the algae off the plastic trough.I found that this medium duty scrubber works great for most jobs. Scrubbing shower grout and other bathroom cleaning would be finished quick with this brush!!It's really amazing, and works so well!! 10 stars! (If I could)\n","id":"0268797b-e369-4119-827d-d36b51751e9a"},{"text":"\n  We bought this with the intention of using for our bathtub. While are tub isn't grossly dirty, it does have little bubbles on it to help with slipping but it is hard to clean those out. This didn't really do much at all. While the bristles are firm it does nothing to actually clean anything. There is no give so that the bristles can actually get into any crevice or nook & cranny. This brush can only glide over everything not doing much. If you need something to polish your bathroom with, that may work.\n","id":"30da698c-867a-41dd-9cf2-79e17a0a7ff2"},{"text":"\n  This cleans the heck out of my shower. No caked on soap scum has a chance. I was using some fairly harsh cleaners to get my shower clean before, but now I can use something like Simple Green and when combined with this brush it gets almost everything.My two complaints are it won't get in to a corner, but they do make other brushes specifically for this. The edge also can rub against an adjacent surface if you are not careful. It would be nice if the bristles stuck out past the hard plastic edge. Two, is that you do end up with some cleaner flinging off of the edge at high speed. This is only really a concern when cleaning near the edge of my shower enclosure.\n","id":"2f75e169-c40c-40a4-b994-59365f1e7eaf"},{"text":"\n  First off, the drill fitting attached to this is too big to go into the drill directly so you need a huge socket that’s also deep enough for it not to fly out while you’re using it. Second, the wide black rim sticks out so far beyond the brush that if you get too close to any trim it peels the paint off and leaves a black mark too. Just horrible.\n","id":"8223c03a-d94f-42b8-9223-620017a4c642"},{"text":"\n  I bought this to clean my composite wood deck.  It hadn’t been done in years and was covered in algae type growth.  It cleaned it so well.  Took the stuff off immediately.  Spraying it never even touched it.  I started with just scrubbing with a regular brush but that was so much work, so I decided to give this a try. So glad I did!\n","id":"f88de89f-f8f2-486e-b1c8-64a0c1cb329e"},{"text":"\n  product recieved is defective .. not working\n","id":"90aeaadc-6aa5-48d7-a202-e52df285aee7"},{"text":"\n  Cup works for the rice cooker so I don't have to convert from freedom units and do math. The paddle is great for hitting people that try to make me do math.\n","id":"d95c068c-1227-4188-8520-80890721aa7a"},{"text":"\n  My roommate and I both have identical rice cookers.  Recently, the measuring cup and rice spoon for mine mysteriously disappeared.  Rather than fight over it, I upgraded!The cup is metal and looks nothing like her cups and the bamboo rice spoon is unmistakably mine.  It's also made of bamboo so is perfect for plastic-guilting her about her rice spoons.  Sure, it's a bit of virtue signaling, but it really does make me feel better about my culinary choices.  :-)\n","id":"ca7d66be-e2cc-4202-b05c-f3a588cf9ddc"},{"text":"\n  This is a picture on how I was trying to salvage my rice but to no avail,  half was cooked and half was uncooked . I own this tiger rice cooker since 2003 and I lost my rice cup so I bought this. I am Asian by the way and so I thought that this will be a perfect solution to my problem. Turned out I made the worst rice ever. I made better with an old small mug.\n","id":"5e4eccb3-dfe9-4f86-bc5a-ad4041746203"},{"text":"\n  I was in the process of replacing all plastics in my kitchen with stainless steel and found this measuring cup! So glad I found this item! It's very high quality, durable and nice looking! The price is so cheap too! I would highly recommend this to anyone who's looking for durable and safe kitchen tools.\n","id":"34a0646f-4d92-4fb6-be31-34fad66637fc"},{"text":"\n  Understand that size, in this case, matters. I am enjoying the cum and spoon, my inability to use it because it is seems to be a cup to measure metric system, but otherwise the measuring cup does wht it is supposed to do\n","id":"7e8ff98f-31b3-47b3-8f30-f9391c4af699"},{"text":"\n  Thank you for a healthy, quality product.Can I check when the buffalo stock is available?  will like to try them too.\n","id":"318d0f18-52a7-4a32-8d94-6c72e0194815"},{"text":"\n  My husband is a beef stew aficionado, and I am an organic nut.  Our beef stew is all organic except for the seasoning packet.  It bothered me to no end knowing there was MSG and soy and all the other nasties in our McCormick packets.  So I stumbled upon these and bought them (in bulk no less since that was all that was available) and was actually nervous. My husband loves beef stew and doesn't like change.  If he didn't like them, he would cease and desist from using them ever again.  So... not only did we both like them, but he said they actually made the stew taste even better!!!  Which honestly, they did!  I compared the ingredients before I bought and they were very similar to what we were already using, so I am not sure what the difference in flavor is, but it is noticeable and awesome!  Now we officially have a completely organic beef stew meal for the winter.\n","id":"c7b899ea-0596-4b2f-aa75-b7dff1df46d9"},{"text":"\n  LOVE it! Aside from the spice mix, I add chopped onion, garlic, a bay leaf, fresh orange and lime juice (and part of the rind of each for extra flavor) and cilantro. Seal and cook on the \"stew\" function for 35 minutes in my Instant Pot and what comes out is extremely tender, flavorful and juicy. I usually scoop out the carnitas (I've made with both pork butt and tenderloin and both come out fabulous) and place them under the broiler in a cast iron pan until the tops get a nice char to finish them off.  They're great over rice and as a sandwich. But of course, nothing beats tortillas. This is a great spice mix. So happy I tried it\n","id":"414ce91a-94c6-4ccf-98a3-0056719196d1"},{"text":"\n  This is fantastic seasoning, though we still add just a little pepper.\n","id":"05922f16-ac87-4920-86a1-36904c1b9c7c"},{"text":"\n  Made beef stew today and the flavor was savory. Best stew beef mix I’ve ever used. Highly recommend.\n","id":"af59af40-b1c6-4dfa-9593-31c71887be4a"},{"text":"\n  Ordered 1 case of 12. Received 1 loose packet.\n","id":"ba853cbb-7eb8-41d2-99eb-d40791af1762"},{"text":"\n  Al however there is part multiple individuals in my family yet I constantly cherished the idea of cooking for two and this book gave it great. Formulas are efficient and pleasantly arranged with appropriate clarification and comprehension with subtleties to pursue. I have made few with a bit ad libbing and I am charmed by the outcome. Definitely justified even despite the buy.\n","id":"cd233002-cebd-4bfe-b159-752b0ccce9af"},{"text":"\n  This Best Pressure Cooker Rice Cookbook is a best choice for those who usually take interest in cooking. This Best Pressure Cooker Rice Cookbook can be proved helpful for everyone, complete process of using this instant pot has been mentioned for better understanding, recommended.I was happy to find this resource. I was expecting more day-to-day reference recipes. I have tried are easy and delicious! I am grateful. I liked or what I would do differently next time.love this book, step by step instructions. this book to try something different.\n","id":"c18cf772-dd5a-44e2-bd8a-f0d3b6dd6d6e"},{"text":"\n  It was a very easy read and provided very detailed information, pros and cons of each option and helpful resources. I also love the tone of this book and the personable manner it was written. Full of wonderful recipes,this cookbook turned out to be extremely helpful. I love rice and so does my family, therefore to enrich my dishes with quite a few great recipes, accompanied by helpful explanations and pictures, was a wonderful idea.\n","id":"e152611b-cc19-4008-816b-9972304cda8d"},{"text":"\n  This is exactly what I needed at a reasonable cost. Some extra receipes for a gluten free individual who eats a ton of rice and cherishes my cooker as the rices turn out impeccable inevitably. I likewise am simply figuring out how extraordinary in taste and surface there are of numerous rices. I discovered this guide from Amazon and recommend for all in the event that you need great, sound life so you can attempt this manual. Much thanks!\n","id":"579595cd-f2d9-44c2-b1b8-0d0e55e76435"},{"text":"\n  This book offers inconceivable, adaptable and direct sustenance and no issue. It has direct all around asked for procedure on the best way to deal with utilize the specific power more sultry and help make specific dishes about it. Find the right blend with your rice, use your scent rice cooker and offer it with the whole family.\n","id":"16a453c8-13c1-4ae2-b87b-4d65dc8293d1"}]